[
    {
        "processedData": {
            "totalContent": 52,
            "listContent": [
                {
                    "newsTitle": "runc container breakout  vulnerabilities: A technical overview",
                    "newsContentSnippet": "A set of high-severity vulnerabilities in runc were publicly disclosed in November 2025, allowing for full container breakouts. Runc is the cornerstone of containerization on Linux, serving as the default low-level container runtime for industry-standard tools...",
                    "newsPublishDate": "2025-11-28T12:00:00.000Z",
                    "newsLink": "https://www.cncf.io/blog/2025/11/28/runc-container-breakout-vulnerabilities-a-technical-overview/"
                },
                {
                    "newsTitle": "From chaos to clarity: How OpenTelemetry unified observability across clouds",
                    "newsContentSnippet": "Modern applications rarely live in a single place anymore. One organization’s application footprint was spread across AWS, Azure, and GCP, with some workloads still running on-prem. This multi-cloud approach gave them resilience and flexibility, but it...",
                    "newsPublishDate": "2025-11-27T12:00:00.000Z",
                    "newsLink": "https://www.cncf.io/blog/2025/11/27/from-chaos-to-clarity-how-opentelemetry-unified-observability-across-clouds/"
                },
                {
                    "newsTitle": "Announcing Kyverno release 1.16",
                    "newsContentSnippet": "Kyverno 1.16 delivers major advancements in policy as code for Kubernetes, centered on a new generation of CEL-based policies now available in beta with a clear path to GA. This release introduces partial support for namespaced...",
                    "newsPublishDate": "2025-11-26T20:44:24.000Z",
                    "newsLink": "https://www.cncf.io/blog/2025/11/26/announcing-kyverno-release-1-16/"
                },
                {
                    "newsTitle": "An architectural decision: Containers on bare metal or on virtual machines",
                    "newsContentSnippet": "Building and running modern applications begins with selecting Kubernetes distribution as a baseline. Once a platform team has selected its orchestration layer, one of the next architectural choices involves the deployment architecture where that cluster will...",
                    "newsPublishDate": "2025-11-20T13:00:00.000Z",
                    "newsLink": "https://www.cncf.io/blog/2025/11/20/an-architectural-decision-containers-on-bare-metal-or-on-virtual-machines/"
                },
                {
                    "newsTitle": "What is platform engineering?",
                    "newsContentSnippet": "History and evolution of platform engineering Platform engineering is a discipline focused on building and maintaining software development platforms that provide self-service for developer teams, offering the necessary infrastructure for provisioning an application, for example. The...",
                    "newsPublishDate": "2025-11-19T12:05:00.000Z",
                    "newsLink": "https://www.cncf.io/blog/2025/11/19/what-is-platform-engineering/"
                },
                {
                    "newsTitle": "Como monitorar efetivamente sistemas distribuídos?",
                    "newsContentSnippet": "Introdução\nContinue reading on Medium »",
                    "newsPublishDate": "2025-11-29T12:45:12.000Z",
                    "newsLink": "https://medium.com/@renejr03/como-monitorar-efetivamente-sistemas-distribu%C3%ADdos-2d6285de247f?source=rss------observability-5"
                },
                {
                    "newsTitle": "10 FastAPI HPA Signals That Actually Work",
                    "newsContentSnippet": "How to scale your FastAPI apps on Kubernetes without chasing noisy metrics or wasting money.\nContinue reading on Medium »",
                    "newsPublishDate": "2025-11-29T11:02:12.000Z",
                    "newsLink": "https://medium.com/@connect.hashblock/10-fastapi-hpa-signals-that-actually-work-a9012d80b5fa?source=rss------observability-5"
                },
                {
                    "newsTitle": "The story of the infinite glitch — Linux o11y",
                    "newsContentSnippet": "Note: Whether it’s a multi-million dollar enterprise platform or a focused open-source utility, every tool we use for observability is…\nContinue reading on Medium »",
                    "newsPublishDate": "2025-11-29T10:41:43.000Z",
                    "newsLink": "https://medium.com/@ramu.mangalarapu1622/the-story-of-the-infinite-glitch-linux-o11y-7567b565d25d?source=rss------observability-5"
                },
                {
                    "newsTitle": "Jaeger 101",
                    "newsContentSnippet": "1. Introduction\nContinue reading on Medium »",
                    "newsPublishDate": "2025-11-29T08:23:17.000Z",
                    "newsLink": "https://soumiyajit.medium.com/jaeger-101-fb09d8d6d063?source=rss------observability-5"
                },
                {
                    "newsTitle": "AI Tools I Used This Year",
                    "newsContentSnippet": "AI Tools I Used This Year and Why They Made My DevOps Work Less Stressful\nContinue reading on Medium »",
                    "newsPublishDate": "2025-11-29T06:39:20.000Z",
                    "newsLink": "https://safeti.medium.com/ai-tools-i-used-this-year-d646c3118196?source=rss------observability-5"
                },
                {
                    "newsTitle": "Error'd: On the Dark Side",
                    "newsContentSnippet": "...matter of fact, it's all dark.\n\n\n\nGitter Hubber\n checks in on the holidays:\n\"This is the spirit of the Black Friday on GitHub. That's because I'm\nusing dark mode. Otherwise, it would have a different name…\nYou know what? Let's just call it Error Friday!\"\n\n\n\n \n\n\n\"Best get typing!\" self-admonishes.\nJason G.\n  Suffering a surfeit of snark, he proposes\n\"Not sure my battery will last long enough.\n\nFinally, quantum resistant security.\n\nI can't remember my number after the 5000th digit.\n\"  Any of those will do just fine.\n\n\n\n \n\n\nDon't count \nCalle L.\n out.\n\"This is for a calorie tracking app, on Thanksgiving. Offer was so delicious\nit wasn't even a number any more! Sadly it did not slim the\nprice down more than expected.\"\n\n\n\n \n\n\n\n\"Snow and rain and rain and snow!\" exclaims\nPaul N.\n\n\"Weather so astounding, they just had\nto trigger three separate notifications at the same time.\"\n\n\n\n \n\n\n\nIt's not a holiday for everyone though, is it? Certainly not for \nMichael R.\n, who\nis back with a customer service complaint about custom deliveries. \n\"I am unlucky with my deliveries. This time it's DPD.\n\"\n\n\n\n \n\n\n\n\t[Advertisement] Plan Your .NET 9 Migration with Confidence\nYour journey to .NET 9 is more than just one decision.Avoid migration migraines with the advice in this free guide. Download Free Guide Now!",
                    "newsPublishDate": "2025-11-28T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/on-the-dark-side"
                },
                {
                    "newsTitle": "Classic WTF: Teleported Release",
                    "newsContentSnippet": "It's a holiday in the US today, one where we give thanks. And today, we give thanks to not have this boss. Original. --Remy\nMatt works at an accounting firm, as a data engineer. He makes reports for people who don’t read said reports. Accounting firms specialize in different areas of accountancy, and Matt’s firm is a general firm with mid-size clients.\nThe CEO of the firm is a legacy from the last century. The most advanced technology on his desk is a business calculator and a pencil sharpener. He still doesn’t use a cellphone. But he does have a son, who is “tech savvy”, which gives the CEO a horrible idea of how things work.\nUsually, this is pretty light, in that it’s sorting Excel files or sorting the output of an existing report. Sometimes the requests are bizarre or utter nonsense. And, because the boss doesn’t know what the technical folks are doing, some of the IT staff may be a bit lazy about following best practices.\nThis means that most of Matt’s morning is spent doing what is essentially Tier 1 support before he gets into doing his real job. Recently, there was a worse crunch, as actual support person Lucinda was out for materinity leave, and Jackie, the one other developer, was off on vacation on a foreign island with no Internet. Matt was in the middle of eating a delicious lunch of take-out lo mein when his phone rang. He sighed when he saw the number.\n“Matt!” the CEO exclaimed. “Matt! We need to do a build of the flagship app! And a deploy!”\nThe app was rather large, and a build could take upwards of 45 minutes, depending on the day and how the IT gods were feeling. But the process was automated, the latest changes all got built and deployed each night. Anything approved was released within 24 hours. With everyone out of the office, there hadn’t been any approved changes for a few weeks.\nMatt checked the Github to see if something went wrong with the automated build. Everything was fine.\n“Okay, so I’m seeing that everything built on GitHub and everything is available in production,” Matt said.\n“I want you to do a manual build, like you used to.”\n“If I were to compile right now, it could take quite awhile, and redeploying runs the risk of taking our clients offline, and nothing would be any different.”\n“Yes, but I want a build that has the changes which Jackie was working on before she left for vacation.”\nMatt checked the commit history, and sure enough, Jackie hadn’t committed any changes since two weeks before leaving on vacation. “It doesn’t looked like she pushed those changes to Github.”\n“Githoob? I thought everything was automated. You told me the process was automated,” the CEO said.\n“It’s kind of like…” Matt paused to think of an analogy that could explain this to a golden retriever. “Your dishwasher, you could put a timer on it to run it every night, but if you don’t load the dishwasher first, nothing gets cleaned.”\nThere was a long pause as the CEO failed to understand this. “I want Jackie’s front-page changes to be in the demo I’m about to do. This is for Initech, and there’s millions of dollars riding on their account.”\n“Well,” Matt said, “Jackie hasn’t pushed- hasn’t loaded her metaphorical dishes into the dishwasher, so I can’t really build them.”\n“I don’t understand, it’s on her computer. I thought these computers were on the cloud. Why am I spending all this money on clouds?”\n“If Jackie doesn’t put it on the cloud, it’s not there. It’s uh… like a fax machine, and she hasn’t sent us the fax.”\n“Can’t you get it off her laptop?”\n“I think she took it home with her,” Matt said.\n“So?”\n“Have you ever seen Star Trek? Unless Scotty can teleport us to Jackie’s laptop, we can’t get at her files.”\nThe CEO locked up on that metaphor. “Can’t you just hack into it? I thought the NSA could do that.”\n“No-” Matt paused. Maybe Matt could try and recreate the changes quickly? “How long before this meeting?” he asked.\n“Twenty minutes.”\n“Just to be clear, you want me to do a local build with files I don’t have by hacking them from a computer which may or may not be on and connected to the Internet, and then complete a build process which usually takes 45 minutes- at least- deploy to production, so you can do a demo in twenty minutes?”\n“Why is that so difficult?” the CEO demanded.\n“I can call Jackie, and if she answers, maybe we can figure something out.”\nThe CEO sighed. “Fine.”\nMatt called Jackie. She didn’t answer. Matt left a voicemail and then went back to eating his now-cold lo mein.\n\n\t[Advertisement] Picking up NuGet is easy. Getting good at it takes time. Download our guide to learn the best practice of NuGet for the Enterprise.",
                    "newsPublishDate": "2025-11-27T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/classic-wtf-teleported-release"
                },
                {
                    "newsTitle": "Announcements: We Want Your Holiday Horrors",
                    "newsContentSnippet": "As we enter into the latter portion of the year, folks are traveling to visit family, logging off of work in hopes that everything can look after itself for a month, and somewhere, someone, is going to make the choice \"yes, I can push to prod on Christmas Eve, and it'll totally work out for me!\"\nOver the next few weeks, I'm hoping to get a chance to get some holiday support horrors up on the site, in keeping with the season. Whether it's the absurd challenges of providing family tech support, the last minute pushes to production, the five alarm fires caused by a pointy-haired-bosses's incompetence, we want your tales of holiday IT woe.\nSo hit that submit button on the side bar, and tell us who's on Santa's naughty list this year.\n\n\t [Advertisement] \n\tProGet’s got you covered with security and access controls on your NuGet feeds. Learn more.",
                    "newsPublishDate": "2025-11-26T10:00:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/we-want-your-holiday-horrors"
                },
                {
                    "newsTitle": "Tales from the Interview: Interview Smack-Talk",
                    "newsContentSnippet": "In today's Tales from the Interview, our Anonymous submitter relates their experience with an anonymous company:\nI had made it through the onsite, but along the way I had picked up some toxic work environment red flags. Since I had been laid off a couple months prior, I figured I wasn't in a position to be picky, so I decided I would still give it my best shot and take the job if I got it, but I'd continue looking for something better.\nThen they brought me back onsite a second time for one final interview with 2 senior managers. I went in and they were each holding a printout of my resume. They proceeded to go through everything on it. First they asked why I chose the university I went to, then the same for grad school, which was fine.\n\nThen they got to my first internship. I believe the conversation went something like this:\nManager: \"How did you like it?\"\nMe: \"Oh, I loved it!\"\nManager: \"Were there any negatives?\"\nMe: \"No, not that I can think of.\"\nManager: \"So it was 100% positive?\"\nMe: \"Yep!\"\nAnd then they got to my first full-time job, where the same manager repeated the same line of questioning but pushed even harder for me to say something negative, at one point saying \"Well, you left for (2nd company on my resume), so there must have been something negative.\"\nI knew better than to bad-mouth a previous employer in an interview, it's like going into a first date and talking smack about your ex. But what do you do when your date relentlessly asks you to talk smack about all your exes and refuses to let the subject turn to anything else? This not only confirmed my suspicions of a toxic work environment, I also figured *they* probably knew it was toxic and were relentlessly testing every candidate to make sure they wouldn't blow the whistle on them.\nThat was the most excruciatingly awkward interview I've ever had. I didn't get the job, but at that point I didn't care anymore, because I was very, very sure I didn't want to work there in the long term.\nI'm glad Subby dodged that bullet, and I hope they're in a better place now.\nIt seems like this might be some stupid new trend. I recently bombed an interview where I could tell I wasn't giving the person the answer on their checklist, no matter how many times I tried. It was a question about how I handled it when someone opposed what I was doing at work or gave me negative feedback. It felt like they wanted me to admit to more fur-flying drama and fireworks than had ever actually occurred.\nI actively ask for and welcome critique on my writing, it makes my work so much better. And if my work is incorrect and needs to be redone, or someone has objections to a project I'm part of, I seek clarification and (A) implement the requested changes, (B) explain why things are as they are and offer alternate suggestions/solutions, (C) seek compromise, depending on the situation. I don't get personal about it.\nSo, why this trend? Subby believed it was a way to test whether the candidate would someday badmouth the employer. That's certainly feasible, though if that were the goal, you'd think Subby would've passed their ordeal with flying colors. I'm not sure myself, but I have a sneaking suspicion that the nefarious combination of AI and techbro startup culture have something to do with it.\nSo perhaps I also dodged a bullet: one of the many things I'm grateful for this Thanksgiving.\nFeel free to share your ideas, and any and all bullets you have dodged, in the comments.\n\n\t[Advertisement] Picking up NuGet is easy. Getting good at it takes time. Download our guide to learn the best practice of NuGet for the Enterprise.",
                    "newsPublishDate": "2025-11-26T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/interview-smack-talk"
                },
                {
                    "newsTitle": "CodeSOD: The Map to Your Confession",
                    "newsContentSnippet": "Today, Reginald approaches us for a confession.\nHe writes:\nI've no idea where I \"copied\" this code from five years ago. The purpose of this code was to filter out Maps and Collections Maybe the intention was to avoid a recursive implementation by an endless loop? I am shocked that I wrote such code.\nWell, that doesn't bode well, Reginald. Let's take a look at this Java snippet:\n/**\n * \n * @param input\n * @return\n */\nprotected Map rearrangeMap(Map input) {\n\tMap retMap = new HashMap();\n\n\tif (input != null && !input.isEmpty()) {\n\n\t\tIterator it = input.keySet().iterator();\n\t\twhile (true) {\n\t\t\tString key;\n\t\t\tObject obj;\n\t\t\tdo {\n\t\t\t\tdo {\n\t\t\t\t\tif (!it.hasNext()) {\n\t\t\t\t\t}\n\t\t\t\t\tkey = (String) it.next();\n\n\t\t\t\t} while (input.get(key) instanceof Map);\n\n\t\t\t\tobj = input.get(key);\n\n\t\t\t} while (obj instanceof Boolean && ((Boolean) obj).equals(Boolean.FALSE));\n\n\t\t\tif (obj != null) {\n\t\t\t\tretMap.put(key, obj);\n\t\t\t\treturn retMap;\n\t\t\t}\n\t\t}\n\t} else {\n\t\treturn retMap;\n\t}\n}\n\nThe first thing that leaps out is that this is a non-generic Map, which is always a code smell, but I suspect that's the least of our problems.\nWe start by verifying that the input Map exists and contains data. If the input is null or empty, we return it. In our main branch, we create an iterator across the keys, before ethering a while(true) loop. So far so bad\nThen we enter a pair of nested do loops. Which definitely hints that we've gone off the edge of the map here. In the inner most loop, we do a check- if there isn't a next element in the iterator, we… do absolutely nothing. Whether there is or isn't an element, we advance to the next element, risking a NoSuchElementException. We do this while the key points to an instance of Map. As always, an instanceof check is a nauseating code stench.\nOkay, so the inner loop skips across any keys that point to maps, and throws an exception when it gets to the end of the list.\nThe surrounding loop skips over every key that is a boolean value that is also false.\nIf we find anything which isn't a Map and isn't a false Boolean and isn't null, we put it in our retMap and return it.\nThis function finds the first key that points to a non-map, non-false value and creates a new map that contains only that key/value. Which it's a hard thing to understand why I'd want that, especially since some Map implementations make no guarantee about order. And even if I did want that, I definitely wouldn't want to do that this way. A single for loop could have solved this problem.\nReginald, I don't think there's any absolution for this. Instead, my advice would be to install a carbon monoxide detector in your office, because I have some serious concerns about whether or not your brain is getting enough oxygen.\n\n\t [Advertisement] \n\tUtilize BuildMaster to release your software with confidence, at the pace your business demands. Download today!",
                    "newsPublishDate": "2025-11-25T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/the-map-to-your-confession"
                },
                {
                    "newsTitle": "CodeSOD: Copied Homework",
                    "newsContentSnippet": "Part of the \"fun\" of JavaScript is dealing with code which comes from before sensible features existed. For example, if you wanted to clone an object in JavaScript, circa 2013, that was a wheel you needed to invent for yourself, as this StackOverflow thread highlights.\nThere are now better options, and you'd think that people would use them. However, the only thing more \"fun\" than dealing with code that hasn't caught up with the times is dealing with developers who haven't, and still insist on writing their own versions of standard methods.\n  const objectReplace = (oldObject, newObject) => {\n    let keys = Object.keys(newObject)\n    try {\n      for (let key of keys) {\n        oldObject[key] = newObject[key]\n      }\n    } catch (err) {\n      console.log(err, oldObject)\n    }     \n\n    return oldObject\n  }\n\nIt's worth noting that Object.entries returns an array containing both the keys and values, which would be a more sensible for this operation, but then again, if we're talking about using correct functions, Object.assign would replace this function.\nThere's no need to handle errors here, as nothing about this assignment should throw an exception.\nThe thing that really irks me about this though is that it pretends to be functional (in the programming idiom sense) by returning the newly modified value, but it's also just changing that value in place because it's a reference. So it has side effects, in a technical sense (changing the value of its input parameters) while pretending not to. Now, I probably shouldn't get too hung up on that, because that's also exactly how Object.assign behaves, but dammit, I'm going to be bothered by it anyway. If you're going to reinvent the wheel, either make one that's substantially worse, or fix the problems with the existing wheel.\nIn any case, the real WTF here is that this function is buried deep in a 15,000 line file, written by an offshore contract team, and there are at least 5 other versions of this function, all with slightly different names, but all basically doing the same thing, because everyone on the team is just copy/pasting until they get enough code to submit a pull request.\nOur submitter wonders, \"Is there a way to train an AI to not let people type this?\"\nNo, there isn't. You can try rolling that boulder up a hill, but it'll always roll right back down. Always and forever, people are going to write bad code.\n\n\t [Advertisement] \n\tUtilize BuildMaster to release your software with confidence, at the pace your business demands. Download today!",
                    "newsPublishDate": "2025-11-24T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/copied-homework"
                },
                {
                    "newsTitle": "Error'd: Untimely",
                    "newsContentSnippet": "Sometimes, it's hard to know just when you are. This morning, I woke up to a Macbook that thinks it's in Paris, four hours ago. Pining for pain chocolate. A bevy of anonyms have had similar difficulties.\n\n\nFirst up, an unarabian anonym observes\n\"They say that visiting Oman feels like traveling back in time to before the rapid modernization of the Arab states. I just think their eVisa application system is taking this \"time travel\" thing a bit too far...\n\"\n\n\n\n \n\n\nSnecod, an unretired (anteretired?) anonym finds it hard to plan when the calendar is unfixed.\n\"The company's retirement plan was having a rough time prior to Second June.\"\nLooks like the first wtf was second March.\n\n\n\n \n\n\nAnd an unamerican anonym sent us this (uh, back in first March)\n\"Was looking to change the cable package I have from them. Apparently my discounts are all good until 9th October 1930, and a second one looking good until 9th January 2024.\"\n\n\n\n \n\n\nOn a different theme, researcher\nJennifer E.\n exclaimed \n \"Those must have been BIG divorces!\nGuy was so baller Wikipedia couldn’t figure out when he divorced either of these women.\"\nOr so awful they divorced him continuously.\n\n\n\n \n\n\nFinally, parsimonious \nGreg L.\n saved this for us.\n\"I don't remember much about #Error!, but I guess it was an interesting day.\"\n\n\n\n \n\n\n\n\t [Advertisement] \n\tKeep the plebs out of prod. Restrict NuGet feed privileges with ProGet. Learn more.",
                    "newsPublishDate": "2025-11-21T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/untimely"
                },
                {
                    "newsTitle": "CodeSOD: Invalid Route and Invalid Route",
                    "newsContentSnippet": "Someone wanted to make sure that invalid routes logged an error in their Go web application. Artem found this when looking at production code.\nif (requestUriPath != \"/config:system\") &&\n    (requestUriPath != \"/config:system/ntp\") &&\n    (requestUriPath != \"/config:system/ntp/servers\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/config\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/config/address\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/config/key-id\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/config/minpoll\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/config/maxpoll\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/config/version\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/state\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/state/address\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/state/key-id\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/state/minpoll\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/state/maxpoll\") &&\n    (requestUriPath != \"/config:system/ntp/servers/server/state/version\") {\n    log.Info(\"ProcessGetNtpServer: no return of ntp server state for \", requestUriPath)\n    return nil\n}\n\nThe most disturbing part of this, for Artem, isn't that someone wrote this code and pushed it to production. It's that, according to git blame, two people wrote this code, because the first developer didn't include all the cases.\nFor the record, the application does have an actual router module, which can trigger logging on invalid routes.\n\n\t [Advertisement] \n\tKeep the plebs out of prod. Restrict NuGet feed privileges with ProGet. Learn more.",
                    "newsPublishDate": "2025-11-20T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/invalid-route-and-invalid-route"
                },
                {
                    "newsTitle": "CodeSOD: Are You Mocking Me?",
                    "newsContentSnippet": "Today's representative line comes from Capybara James (most recently previously). It's representative, not just of the code base, but of Goodhart's Law: when a measure becomes a target, it ceases to be a good measure. Or, \"you get what you measure\".\nIf, for example, you decide that code coverage metrics are how you're going to judge developers, then your developers are going to ensure that the code coverage looks great. If you measure code coverage, then you will get code coverage- and nothing else.\nThat's how you get tests like this:\nMockito.verify(exportRequest, VerificationModeFactory.atLeast(0)).failedRequest(any(), any(), any());\n\nThis test passes if the function exportRequest.failedRequest is called at least zero times, with any input parameters.\nWhich, as you might imagine, is a somewhat useless thing to test. But what's important is that there is a test. The standards for code coverage are met, the metric is satisfied, and Goodhart marks up another win on the board.\n\n\t [Advertisement] \n\tUtilize BuildMaster to release your software with confidence, at the pace your business demands. Download today!",
                    "newsPublishDate": "2025-11-19T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/are-you-mocking-me"
                },
                {
                    "newsTitle": "Using an ADE: Ancient Development Environment",
                    "newsContentSnippet": "One of the things that makes legacy code legacy is that code, over time, rots. Some of that rot comes from the gradual accumulation of fixes, hacks, and kruft. But much of the rot also comes from the tooling going unsupported or entirely out of support.\nFor example, many years ago, I worked in a Visual Basic 6 shop. The VB6 IDE went out of support in April, 2008, but we continued to use it well into the next decade. This made it challenging to support the existing software, as the IDE frequently broke in response to OS updates. Even when we started running it inside of a VM running an antique version of Windows 2000, we kept running into endless issues getting projects to compile and build.\nA fun side effect of that: the VB6 runtime remains supported. So you can run VB6 software on modern Windows. You just can't modify that software.\nGreta has inherited an even more antique tech stack. She writes, \"I often wonder if I'm the last person on Earth encumbered with this particular stack.\" She adds, \"The IDE is long-deprecated from a vendor that no longer exists- since 2002.\" Given the project started in the mid 2010s, it may have been a bad choice to use that tech-stack.\nIt's not as bad as it sounds- while the technology and tooling is crumbling ruins, the team culture is healthy and the C-suite has given Greta wide leeway to solve problems. But that doesn't mean that the tooling isn't a cause of anguish, and even worse than the tooling- the code itself.\n\"Some things,\" Greta writes, \"are 'typical bad'\" and some things \"are 'delightfully unique' bad.\"\nFor example, the IDE has a concept of \"designer\" files, for the UI, and \"code behind\" files, for the logic powering the UI. The IDE frequently corrupts its own internal state, and loses the ability to properly update the designer files. When this happens, if you attempt to open, save, or close a designer file, the IDE pops up a modal dialog box complaining about the corruption, with a \"Yes\" and \"No\" option. If you click \"No\", the modal box goes away- and then reappears because you're seeing this message because you're on a broken designer file. If you click \"Yes\", the IDE \"helpfully\" deletes pretty much everything in your designer file.\nNothing about the error message indicates that this might happen.\nThe language used is a dialect of C++. I say \"dialect\" because the vendor-supplied compiler implements some cursed feature set between C++98 and C++11 standards, but doesn't fully conform to either. It's only capable of outputting 32-bit x86 code up to a Pentium Pro. Using certain C++ classes, like std::fstream, causes the resulting executable to throw a memory protection fault on exit.\nWorse, the vendor supplied class library is C++ wrappers on top of an even more antique Pascal library. The \"class\" library is less an object-oriented wrapper and more a collection of macros and weird syntax hacks. No source for the Pascal library exists, so forget about ever updating that.\nBecause the last release of the IDE was circa 2002, running it on any vaguely modern environment is prone to failures, but it also doesn't play nicely inside of a VM. At this point, the IDE works for one session. If you exit it, reboot your computer, or try to close and re-open the project, it breaks. The only fix is to reinstall it. But the reinstall requires you to know which set of magic options actually lets the install proceed. If you make a mistake and accidentally install, say, CORBA support, attempting to open the project in the IDE leads to a cascade of modal error boxes, including one that simply says, \"ABSTRACT ERROR\" (\"My favourite\", writes Greta). And these errors don't limit themselves to the IDE; attempting to run the compiler directly also fails.\nBut, if anything, it's the code that makes the whole thing really challenging to work with. While the UI is made up of many forms, the \"main\" form is 18,000 lines of code, with absolutely no separation of concerns. Actually, the individual forms don't have a lot of separation of concerns; data is shared between forms via global variables declared in one master file, and then externed into other places. Even better, the various sub-forms are never destroyed, just hidden and shown, which means they remember their state whether you want that or not. And since much of the state is global, you have to be cautious about which parts of the state you reset.\nGreta adds:\nThere are two files called main.cpp, a Station.cpp, and a Station1.cpp. If you were to guess which one owns the software's entry point, you would probably be wrong.\nBut, as stated, it's not all as bad as it sounds. Greta writes: \"I'm genuinely happy to be here, which is perhaps odd given how terrible the software is.\" It's honestly not that odd; a good culture can go a long way to making wrangling a difficult tech stack happy work.\nFinally, Greta has this to say:\nWe are actively working on a .NET replacement. A nostalgic, perhaps masochistic part of me will miss the old stack and its daily delights.\n\n\t[Advertisement] Picking up NuGet is easy. Getting good at it takes time. Download our guide to learn the best practice of NuGet for the Enterprise.",
                    "newsPublishDate": "2025-11-18T06:30:00.000Z",
                    "newsLink": "https://thedailywtf.com/articles/using-an-ade-ancient-development-environment"
                },
                {
                    "newsTitle": " Optimising Terraform Performance: Remote Backends, Parallelism & many more",
                    "newsContentSnippet": "Setup Terraform Efficiently using Backends, Parallelism & Modules.\nContinue reading on DevOps.dev »",
                    "newsPublishDate": "2025-11-29T16:47:32.000Z",
                    "newsLink": "https://blog.devops.dev/optimising-terraform-performance-remote-backends-parallelism-many-more-27f1b9b16e3d?source=rss------nodejs-5"
                },
                {
                    "newsTitle": "Building a Customer Support AI Assistant With Node.js",
                    "newsContentSnippet": "Customer support is one of the first places where AI actually works in the real world.\n Whether you’re running a SaaS product, an…\nContinue reading on Medium »",
                    "newsPublishDate": "2025-11-29T14:42:59.000Z",
                    "newsLink": "https://noncodersuccess.medium.com/building-a-customer-support-ai-assistant-with-node-js-07294356c68d?source=rss------nodejs-5"
                },
                {
                    "newsTitle": "Lightning-as-a-service for agriculture",
                    "newsContentSnippet": "Darryl Lyons, co-founder and Chief Rainmaker at Rainstick, joins the show to dive into advancements in AgTech and how Rainstick is using bioelectricity to enhance agricultural productivity.",
                    "newsPublishDate": "2025-11-28T08:40:00.000Z",
                    "newsLink": "https://stackoverflow.blog/2025/11/28/lightning-as-a-service-for-agriculture/"
                },
                {
                    "newsTitle": "Essential ingredients for enterprise AI success",
                    "newsContentSnippet": "Here, we’ve distilled the survey findings, laid out action items for leadership, and dug into recommendations around agentic AI for the enterprise. Spoiler alert: It all comes back to data quality.",
                    "newsPublishDate": "2025-11-25T17:00:00.000Z",
                    "newsLink": "https://stackoverflow.blog/2025/11/25/essential-ingredients-for-enterprise-ai-success/"
                },
                {
                    "newsTitle": "You’re probably underutilizing your GPUs",
                    "newsContentSnippet": "Ryan is joined by Jared Quincy Davis, CEO and co-founder of Mithril, to explore the importance of efficient resource allocation and GPU utilization in AI, the myth and misconceptions of the GPU shortage, and how the economics of GPU will change with new scheduling and utilization strategies.",
                    "newsPublishDate": "2025-11-25T08:40:00.000Z",
                    "newsLink": "https://stackoverflow.blog/2025/11/25/you-re-probably-underutilizing-your-gpus/"
                },
                {
                    "newsTitle": "Only you can stop AI database drops",
                    "newsContentSnippet": "Ryan is joined by David Hsu, CEO and founder of Retool, to explore how AI is transforming the role of a software developer into a software architect, the increasing accessibility of coding for non-engineers, and the importance of placing guardrails and higher-level programming primitives on AI coding assistants.",
                    "newsPublishDate": "2025-11-21T08:40:00.000Z",
                    "newsLink": "https://stackoverflow.blog/2025/11/21/only-you-can-stop-ai-database-drops/"
                },
                {
                    "newsTitle": "Community Products roadmap update, November 2025",
                    "newsContentSnippet": "An update on recent launches and the upcoming roadmap.",
                    "newsPublishDate": "2025-11-20T16:00:00.000Z",
                    "newsLink": "https://stackoverflow.blog/2025/11/20/community-products-roadmap-update-november-2025/"
                },
                {
                    "newsTitle": "Introducing Stack Internal: Powering the human intelligence layer of enterprise AI",
                    "newsContentSnippet": "Today at Microsoft Ignite, we’re showcasing the next step in our evolution: Stack Overflow for Teams is now Stack Internal. It’s the next phase of our enterprise knowledge platform, reimagined for the AI era.",
                    "newsPublishDate": "2025-11-18T15:00:00.000Z",
                    "newsLink": "https://stackoverflow.blog/2025/11/18/introducing-stack-internal-powering-the-human-intelligence-layer-of-enterprise-ai/"
                },
                {
                    "newsTitle": "How to create agents that people actually want to use",
                    "newsContentSnippet": "Ryan welcomes Assaf Elovic, head of AI at monday.com, to discuss creating AI tools that users will actually adopt, how they created their Monday Sidekick agent with the user experience in mind, and the opportunities that AI creates for better productivity and more efficiency.",
                    "newsPublishDate": "2025-11-18T08:40:00.000Z",
                    "newsLink": "https://stackoverflow.blog/2025/11/18/how-to-create-agents-that-people-actually-want-to-use/"
                },
                {
                    "newsTitle": "The fastest agent in the race has the best evals",
                    "newsContentSnippet": "Ryan welcomes Benjamin Klieger, lead engineer at Groq, to explore the infrastructure behind AI agents, how you can turn a one-minute agent into a ten-second agent, and how they used fast inference and effective evals to build their efficient and reliable Compound agent.",
                    "newsPublishDate": "2025-11-14T08:40:00.000Z",
                    "newsLink": "https://stackoverflow.blog/2025/11/14/the-fastest-agent-in-the-race-has-the-best-evals/"
                },
                {
                    "newsTitle": "Hacker Newsletter #772",
                    "newsContentSnippet": "body { background: #FFF; }\n  body, h1, h2, h3, p, table, tr, td {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    margin: 0;\n    padding: 0;\n  }\n  .main, table { background-color: #FFFFFF; }\n  a { color: #1786C1; text-decoration: underline; }\n  a:hover { text-decoration: none; }\n  h1 {\n    font-size: 35px;\n    margin-bottom: 5px;\n    padding-top: 10px;\n    width: 100%;\n  }\n  h1 a { color: #333; text-decoration: none; }\n  h1 a:hover { color: #666; text-decoration: underline; }\n  h2 {\n    color: #cc0000;\n    font-size: 16px;\n    font-weight: bold;\n    margin: 20px 0 10px;\n  }\n  h3 {\n    border-bottom: 1px solid #333;\n    border-top: 3px solid #333;\n    font-size: 16px;\n    font-weight: normal;\n    line-height: 22px;\n    margin: 20px 0;\n    padding: 20px 0;\n  }\n  p {\n    color: #333;\n    font-size: 16px;\n    line-height: 24px;\n    width: 500px;\n  }\n  p {\n    font-size: 16px;\n    line-height: 22px;\n    margin: 0 0 10px 0;\n    width: 100%;\n  }\n  table, .main, #header, #footer { max-width: 600px; width: 100%; }\n  #header { margin-bottom: 20px; }\n  #issue {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    font-size: 12px;\n    text-align: right;\n  }\n  #issue i { color: #999; font-style: normal; }\n  \n  @media only screen and (max-device-width: 480px) {\n    table, #header, #content, #footer { padding: 0 20px !important; }\n    h1 { font-size: 30px !important; }\n  }\n  \n  @media only screen and (max-device-width: 679px), only screen and (max-width: 679px) {\n    .main { margin: 20px auto; width: 100%; }\n    table, #header, #content, #footer { padding: 0 30px; width: 100%; }\n  \n    #details { padding-right: 10px; }\n  }\n  \n  @media only screen and (min-width: 680px) {\n    body { background: #999 }\n    #details { width: 496px; }\n    .main, table, #header, #content, #footer { background: #FFF; width: 600px; }\n  \n    .main {\n              box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n         -moz-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      -webkit-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      margin: 10px auto 40px;\n      padding: 30px 40px 10px;\n    }\n  }\n\n\n\n\n\n\n\n\nTo err is human, but even more so is to blame others. //Baltazar Gracián\n\n\n\n\n\n\n\n\nhackernewsletter\n\n\n\n\n\n\nIssue #772\n//\n2025-11-21\n//\nView in your browser\n\n\n\n\n\n\n\n  \n    #\n  \n  Sponsor\n\n\n\n  \nStop Bots from Abusing Free Trials\n      \nWorkOS Radar combines device fingerprinting, behavioral signals, and trial-abuse checks in a single API that keeps signups clean with minimal integration effort.\n    \n  \n#Favorites\nGemini 3\n//blog.google comments→\nAI World Clocks\n//clocks.brianmoore.com comments→\nNano Banana Pro\n//blog.google comments→\nThings that aren't doing the thing\n//strangestloop.io comments→\nMaybe you’re not trying\n//usefulfictions.substack.com comments→\nBuilding a Simple Search Engine That Works\n//karboosx.net comments→\nMessing with scraper bots\n//herman.bearblog.dev comments→\nThe code and open-source tools I used to produce a science fiction anthology\n//compellingsciencefiction.com comments→\nCognitive and mental health correlates of short-form video use\n//psycnet.apa.org comments→\nHow to stay sane in a world that rewards insanity\n//joanwestenberg.com comments→\n#Ask HN\nSenior people, how did your career evolve?\nHow does one stay motivated to grind through LeetCode?\n#Show HN\nAirPods libreated from Apple's ecosystem //github.com comments→\nI made a down detector for down detector //downdetectorsdowndetector.com comments→\nEpstein Files Organized and Searchable //searchepsteinfiles.com comments→\nBrowser-based interactive 3D Three-Body problem simulator //trisolarchaos.com comments→\nContinuous Claude – run Claude Code in a loop //github.com comments→\nRowboatX – open-source Claude Code for everyday automations //github.com comments→\n#Code\nGoogle Antigravity //antigravity.google comments→\nPHP 8.5 //stitcher.io comments→\nCLI tool to check the Git status of multiple projects //github.com comments→\n#Data\nEurope is scaling back GDPR and relaxing AI laws //theverge.com comments→\nParqeye – A CLI tool to visualize and inspect Parquet files //github.com comments→\nRegreSQL: Regression Testing for PostgreSQL Queries //boringsql.com comments→\nVortex: An extensible, state of the art columnar file format //github.com comments→\n#Design\n'Calvin and Hobbes' at 40 //npr.org comments→\nColor Palette Pro //colorpalette.pro comments→\n#Books\nOpen-source Zig book //zigbook.net comments→\nThe Pragmatic Programmer: 20th Anniversary Edition //ahalbert.com comments→\nShort Little Difficult Books //countercraft.substack.com comments→\nMathematics and Computation (2019) [pdf] //math.ias.edu comments→\n#Learn\nInteractive World History Atlas Since 3000 BC //geacron.com comments→\nBasalt Woven Textile //materialdistrict.com comments→\nHow Slide Rules Work //amenzwa.github.io comments→\n#Watching\nTCP, the workhorse of the internet //cefboud.com comments→\nDissecting Flock Safety: The Cameras Tracking You Are a Security Nightmare //youtube.com comments→\nGo Cryptography State of the Union //words.filippo.io comments→\n#Startup News\nReplicate is joining Cloudflare //replicate.com comments→\nReport: Tim Cook could step down as Apple CEO 'as soon as next year' //9to5mac.com comments→\nAMD continues to chip away at Intel's x86 market share //tomshardware.com comments→\n#Fun\nRed Alert 2 in web browser //chronodivide.com comments→\nMicrosoft makes Zork open-source //opensource.microsoft.com comments→\nUnflip – a puzzle game about XOR patterns of squares //unflipgame.com comments→\nBinary Sudoku Puzzle – Foxtrot Comic //foxtrot.com comments→\nSQL Case Files – A browser-based SQL detective game //sqlcasefiles.com comments→\nMy Light & Spirit – A Clever Indie Puzzle Where Light Becomes Your Tool //groober.itch.io comments→\n__END__\nCurpress\nfrom Bellingham, Washington. Hacker Newsletter is not affiliated with Y Combinator in any way.\n\n\n💡 Need to disconnect?\nUnsubscribe\n\n\n✨ Want to promote your startup?\nBuy a classified ad\nor click reply to get our media kit\n\n\n⭐ Not a subscriber? Subscribe at\nhttps://hackernewsletter.com",
                    "newsPublishDate": "2025-11-21T12:30:00.000Z",
                    "newsLink": "https://buttondown.com/hacker-newsletter/archive/772/"
                },
                {
                    "newsTitle": "Hacker Newsletter #771",
                    "newsContentSnippet": "body { background: #FFF; }\n  body, h1, h2, h3, p, table, tr, td {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    margin: 0;\n    padding: 0;\n  }\n  .main, table { background-color: #FFFFFF; }\n  a { color: #1786C1; text-decoration: underline; }\n  a:hover { text-decoration: none; }\n  h1 {\n    font-size: 35px;\n    margin-bottom: 5px;\n    padding-top: 10px;\n    width: 100%;\n  }\n  h1 a { color: #333; text-decoration: none; }\n  h1 a:hover { color: #666; text-decoration: underline; }\n  h2 {\n    color: #cc0000;\n    font-size: 16px;\n    font-weight: bold;\n    margin: 20px 0 10px;\n  }\n  h3 {\n    border-bottom: 1px solid #333;\n    border-top: 3px solid #333;\n    font-size: 16px;\n    font-weight: normal;\n    line-height: 22px;\n    margin: 20px 0;\n    padding: 20px 0;\n  }\n  p {\n    color: #333;\n    font-size: 16px;\n    line-height: 24px;\n    width: 500px;\n  }\n  p {\n    font-size: 16px;\n    line-height: 22px;\n    margin: 0 0 10px 0;\n    width: 100%;\n  }\n  table, .main, #header, #footer { max-width: 600px; width: 100%; }\n  #header { margin-bottom: 20px; }\n  #issue {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    font-size: 12px;\n    text-align: right;\n  }\n  #issue i { color: #999; font-style: normal; }\n  \n  @media only screen and (max-device-width: 480px) {\n    table, #header, #content, #footer { padding: 0 20px !important; }\n    h1 { font-size: 30px !important; }\n  }\n  \n  @media only screen and (max-device-width: 679px), only screen and (max-width: 679px) {\n    .main { margin: 20px auto; width: 100%; }\n    table, #header, #content, #footer { padding: 0 30px; width: 100%; }\n  \n    #details { padding-right: 10px; }\n  }\n  \n  @media only screen and (min-width: 680px) {\n    body { background: #999 }\n    #details { width: 496px; }\n    .main, table, #header, #content, #footer { background: #FFF; width: 600px; }\n  \n    .main {\n              box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n         -moz-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      -webkit-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      margin: 10px auto 40px;\n      padding: 30px 40px 10px;\n    }\n  }\n\n\n\n\n\n\n\n\nIf you're not getting older, you're dead. //Tom Petty\n\n\n\n\n\n\n\n\nhackernewsletter\n\n\n\n\n\n\nIssue #771\n//\n2025-11-14\n//\nView in your browser\n\n\n\n\n\n#Favorites\n//gusto.com\nsponsored\n\n\nSteam Machine / Steam Frame\n//store.steampowered.com comments / comments→\nThe 'Toy Story' You Remember\n//animationobsessive.substack.com comments→\nMarble Fountain\n//willmorrison.net comments→\nRatatui – App Showcase\n//ratatui.rs comments→\nUnexpected things that are people\n//bengoldhaber.substack.com comments→\nCollaboration sucks\n//newsletter.posthog.com comments→\nHow did I get here?\n//how-did-i-get-here.net comments→\nMarko – A declarative, HTML‑based language\n//markojs.com comments→\nMicro.blog launches new 'Studio' tier with video hosting\n//heydingus.net comments→\n#Ask HN\nWhat Are You Working On?\nHow would you set up a child’s first Linux computer?\nHow do you get over the fear of sharing code?\n#Show HN\nBeets: The music geek’s media organizer //beets.io comments→\nAI documentation you can talk to, for every repo //deepwiki.com comments→\nqqqa – A fast, stateless LLM-powered assistant for your shell //github.com comments→\nGametje – A casual online gaming platform //gametje.com comments→\nI built a local-first daily planner for iOS //apps.apple.com comments→\nCreavi Macropad – Built a wireless macropad with a display //creavi.tech comments→\n#Code\nValdi – A cross-platform UI framework that delivers native performance //github.com comments→\n.NET 10 //devblogs.microsoft.com comments→\nThe lazy Git UI you didn't know you need //bwplotka.dev comments→\nVibe Code Warning – A personal casestudy //github.com comments→\nRuby already solved my problem //newsletter.masilotti.com comments→\nOpencloud – An alternative to Nextcloud written in Go //github.com comments→\nBuilding a CI/CD Pipeline Runner from Scratch in Python //muhammadraza.me comments→\n#Data\nDeepnote, a Jupyter alternative, is going open source //deepnote.com comments→\n650GB of Data (Delta Lake on S3). Polars vs. DuckDB vs. Daft vs. Spark //dataengineeringcentral.substack.com comments→\nThe write last, read first rule //tigerbeetle.com comments→\n#Design\nMyna: Monospace typeface designed for symbol-heavy programming languages //github.com comments→\nAvería: The Average Font //iotic.com comments→\nWe ran over 600 image generations to compare AI image models //latenitesoft.com comments→\nM.C. Escher Prints Digitized and Put Online by the Boston Public Library //openculture.com comments→\nThe Mac calculator's original design came from letting Steve play with menus //arstechnica.com comments→\n#Books\nThe Manuscripts of Edsger W. Dijkstra //cs.utexas.edu comments→\nLearn Prolog Now //lpn.swi-prolog.org comments→\nMath Books //github.com comments→\nI made a children's book about WebSockets //websocket.org comments→\nThe Pinouts Book //pinouts.org comments→\n#Working\nAI isn't replacing jobs. AI spending is //fastcompany.com comments→\nAlways be ready to leave (even if you never do) //andreacanton.dev comments→\nZed Is Our Office //zed.dev comments→\n#Learn\nNew gel restores dental enamel and could revolutionise tooth repair //nottingham.ac.uk comments→\nTicker: Don't die of heart disease //myticker.com comments→\nLargest cargo sailboat completes first Atlantic crossing //marineinsight.com comments→\nMetabolic and cellular differences between sedentary and active individuals //howardluksmd.substack.com comments→\nThe Geometry Behind Normal Maps //shlom.dev comments→\nHow Press Photos Were Transmitted Back in the 1970s //petapixel.com comments→\n#Watching\nNear mid-air collision at LAX between American Airlines and ITA //youtube.com comments→\nSimulating a Planet on the GPU: Part 1 //patrickcelentano.com comments→\nHigh speed X-ray video: jumping beans, wind-up toys and more //youtube.com comments→\n100% Apple. This Apple Pie Contains Only Apples //youtube.com comments→\n#Startup News\nSlopStop: Community-driven AI slop detection in Kagi Search //blog.kagi.com comments→\nSoftBank sells its entire stake in Nvidia //cnbc.com comments→\nWaymo robotaxis are now giving rides on freeways in LA, SF and Phoenix //techcrunch.com comments→\nWhat happened to Transmeta, the last big dotcom IPO //dfarq.homeip.net comments→\nJudge denies request to exempt Flock footage from Public Records Act //goskagit.com comments→\nGoogle will allow users to sideload Android apps without verification //android-developers.googleblog.com comments→\nAnthropic invests $50B in US AI infrastructure //anthropic.com comments→\n#Fun\nI Am Mark Zuckerberg //iammarkzuckerberg.com comments→\nTabloid: The Clickbait Headline Programming Language //tabloid.vercel.app comments→\nRealtime BART Arrival Display //filbot.com comments→\nThree Emojis, a daily word puzzle for language learners //threeemojis.com comments→\nContinuum 93 fantasy retro emulator now open source //enthusiastguy.itch.io comments→\n__END__\nCurpress\nfrom Bellingham, Washington. Hacker Newsletter is not affiliated with Y Combinator in any way.\n\n\n💡 Need to disconnect?\nUnsubscribe\n\n\n✨ Want to promote your startup?\nBuy a classified ad\nor click reply to get our media kit\n\n\n⭐ Not a subscriber? Subscribe at\nhttps://hackernewsletter.com",
                    "newsPublishDate": "2025-11-14T12:15:00.000Z",
                    "newsLink": "https://buttondown.com/hacker-newsletter/archive/771/"
                },
                {
                    "newsTitle": "Hacker Newsletter #770",
                    "newsContentSnippet": "body { background: #FFF; }\n  body, h1, h2, h3, p, table, tr, td {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    margin: 0;\n    padding: 0;\n  }\n  .main, table { background-color: #FFFFFF; }\n  a { color: #1786C1; text-decoration: underline; }\n  a:hover { text-decoration: none; }\n  h1 {\n    font-size: 35px;\n    margin-bottom: 5px;\n    padding-top: 10px;\n    width: 100%;\n  }\n  h1 a { color: #333; text-decoration: none; }\n  h1 a:hover { color: #666; text-decoration: underline; }\n  h2 {\n    color: #cc0000;\n    font-size: 16px;\n    font-weight: bold;\n    margin: 20px 0 10px;\n  }\n  h3 {\n    border-bottom: 1px solid #333;\n    border-top: 3px solid #333;\n    font-size: 16px;\n    font-weight: normal;\n    line-height: 22px;\n    margin: 20px 0;\n    padding: 20px 0;\n  }\n  p {\n    color: #333;\n    font-size: 16px;\n    line-height: 24px;\n    width: 500px;\n  }\n  p {\n    font-size: 16px;\n    line-height: 22px;\n    margin: 0 0 10px 0;\n    width: 100%;\n  }\n  table, .main, #header, #footer { max-width: 600px; width: 100%; }\n  #header { margin-bottom: 20px; }\n  #issue {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    font-size: 12px;\n    text-align: right;\n  }\n  #issue i { color: #999; font-style: normal; }\n  \n  @media only screen and (max-device-width: 480px) {\n    table, #header, #content, #footer { padding: 0 20px !important; }\n    h1 { font-size: 30px !important; }\n  }\n  \n  @media only screen and (max-device-width: 679px), only screen and (max-width: 679px) {\n    .main { margin: 20px auto; width: 100%; }\n    table, #header, #content, #footer { padding: 0 30px; width: 100%; }\n  \n    #details { padding-right: 10px; }\n  }\n  \n  @media only screen and (min-width: 680px) {\n    body { background: #999 }\n    #details { width: 496px; }\n    .main, table, #header, #content, #footer { background: #FFF; width: 600px; }\n  \n    .main {\n              box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n         -moz-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      -webkit-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      margin: 10px auto 40px;\n      padding: 30px 40px 10px;\n    }\n  }\n\n\n\n\n\n\n\n\nMake simple things simple. //Bjarne Stroustrup\n\n\n\n\n\n\n\n\nhackernewsletter\n\n\n\n\n\n\nIssue #770\n//\n2025-11-07\n//\nView in your browser\n\n\n\n\n\n\n\n  \n    #\n  \n  Sponsor\n\n\n\n  \nDrop-In API Key Management for SaaS Apps WorkOS API Keys lets developers add secure key management with a drop-in widget for creating, rotating, and revoking keys. Keys tie into WorkOS Organizations and Roles, providing scoped permissions and straightforward validation through the API or SDKs.\n    \n  \n#Favorites\nURLs are state containers\n//alfy.blog comments→\nFacts about throwing good parties\n//atvbt.com comments→\nWhy aren't smart people happier?\n//theseedsofscience.pub comments→\nAI's Dial-Up Era\n//wreflection.com comments→\nWhen stick figures fought\n//animationobsessive.substack.com comments→\nTwo billion email addresses were exposed\n//troyhunt.com comments→\nNearly 90% of Windows Games Now Run on Linux\n//tomshardware.com comments→\nYou should write an agent\n//fly.io comments→\nCarice TC2 – A non-digital electric car\n//caricecars.com comments→\nThe profitable startup\n//linear.app comments→\nNo Socials November\n//bjhess.com comments→\nGame design is simple\n//raphkoster.com comments→\n#Ask HN\nWho uses open LLMs and coding assistants locally? Share setup and laptop\nMy family business runs on a 1993-era text-based-UI (TUI). Anybody else?\nTell HN: Mechanical Turk is twenty years old today\nWhat are you working on?\n#Classifieds\nShow HN: Trendlists Digest of AI, App & Tech topics!  //trendscout.com\nAuthentication and user management, built for B2B SaaS //propelauth.com\nFriends don't let friends use QuickBooks. //puzzle.io\nDeploy your app before your coffee gets cold. The cloud for developers who ship. Sevalla. $50 free credit. //sevalla.com\n✨Book a classified ad for $150✨\n#Show HN\nStrange Attractors //blog.shashanktomar.com comments→\nWhy write code if the LLM can just do the thing? (web app experiment) //github.com comments→\nA CSS-Only Terrain Generator //terra.layoutit.com comments→\nPomelli //blog.google comments→\nqqqa – A fast, stateless LLM-powered assistant for your shell //github.com comments→\n#Code\nHow I use every Claude Code feature //blog.sshh.io comments→\nLearning to read Arthur Whitney's C to become smart //needleful.net comments→\nRuby and Its Neighbors: Smalltalk //noelrappin.com comments→\n#Data\nThe Case Against PGVector //alex-jacobs.com comments→\nSQLite concurrency and why you should care about it //jellyfin.org comments→\nPg_lake: Postgres with Iceberg and data lake access //github.com comments→\nUse DuckDB-WASM to query TB of data in browser //lil.law.harvard.edu comments→\nBloom filters are good for search that does not scale //notpeerreviewed.com comments→\nPipelined Relational Query Language, PRQL: a simple, powerful, pipelined SQL rep //prql-lang.org comments→\n#Design\nMr TIFF //inventingthefuture.ghost.io comments→\nMy Truck Desk //theparisreview.org comments→\nThe 512KB Club //512kb.club comments→\nGallery of wonderful drawings our little thermal printer received //guestbook.goodenough.us comments→\n#Books\nI scraped 3B Goodreads reviews to train a better recommendation model //book.sv comments→\nAn Illustrated Introduction to Linear Algebra, Chapter 2: The Dot Product //ducktyped.org comments→\nThe Art of Atari //artofatari.com comments→\n#Working\nAsk HN: Who is hiring? //news.ycombinator.com\nAsk HN: Who wants to be hired? //news.ycombinator.com\nI analyzed 180M jobs to see what jobs AI is replacing today //bloomberry.com comments→\nWhy Your Best Engineers Are Interviewing Elsewhere, CodeGood //codegood.co comments→\nAsk HN: Freelancer? Seeking freelancer? //news.ycombinator.com\n#Learn\nSolarpunk is happening in Africa //climatedrift.substack.com comments→\nAttention lapses due to sleep deprivation due to flushing fluid from brain //news.mit.edu comments→\nTiny electric motor can produce more than 1,000 horsepower //supercarblondie.com comments→\nThings you can do with diodes //lcamtuf.substack.com comments→\n#Watching\nI was right about dishwasher pods and now I can prove it //youtube.com comments→\nParis had a moving sidewalk in 1900, and a Thomas Edison film captured it //openculture.com comments→\nSkyfall-GS – Synthesizing Immersive 3D Urban Scenes from Satellite Imagery //skyfall-gs.jayinnn.dev comments→\nBending Emacs – Episode 05: Ready Player Mode //youtube.com comments→\n#Startup News\nAmazon confirms 14,000 job losses in corporate division //bbc.com comments→\nOpenAI signs $38B cloud computing deal with Amazon //nytimes.com comments→\nGuideline has been acquired by Gusto //help.guideline.com comments→\n#Fun\nS.A.R.C.A.S.M: Slightly Annoying Rubik's Cube Automatic Solving Machine //github.com comments→\nHyperRogue – A non-Euclidean roguelike //roguetemple.com comments→\nLearn German with Games //learngermanwithgames.com comments→\nBuild your own Bracket City puzzle //builder.bracket.city comments→\nBoard: New game console recognizes physical pieces, with an open SDK //board.fun comments→\nDeepShot – NBA game predictor with 70% accuracy using ML and stats //github.com comments→\n__END__\nCurpress\nfrom Bellingham, Washington. Hacker Newsletter is not affiliated with Y Combinator in any way.\n\n\n💡 Need to disconnect?\nUnsubscribe\n\n\n✨ Want to promote your startup?\nBuy a classified ad\nor click reply to get our media kit\n\n\n⭐ Not a subscriber? Subscribe at\nhttps://hackernewsletter.com",
                    "newsPublishDate": "2025-11-07T12:00:00.000Z",
                    "newsLink": "https://buttondown.com/hacker-newsletter/archive/770/"
                },
                {
                    "newsTitle": "Hacker Newsletter #769",
                    "newsContentSnippet": "body { background: #FFF; }\n  body, h1, h2, h3, p, table, tr, td {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    margin: 0;\n    padding: 0;\n  }\n  .main, table { background-color: #FFFFFF; }\n  a { color: #1786C1; text-decoration: underline; }\n  a:hover { text-decoration: none; }\n  h1 {\n    font-size: 35px;\n    margin-bottom: 5px;\n    padding-top: 10px;\n    width: 100%;\n  }\n  h1 a { color: #333; text-decoration: none; }\n  h1 a:hover { color: #666; text-decoration: underline; }\n  h2 {\n    color: #cc0000;\n    font-size: 16px;\n    font-weight: bold;\n    margin: 20px 0 10px;\n  }\n  h3 {\n    border-bottom: 1px solid #333;\n    border-top: 3px solid #333;\n    font-size: 16px;\n    font-weight: normal;\n    line-height: 22px;\n    margin: 20px 0;\n    padding: 20px 0;\n  }\n  p {\n    color: #333;\n    font-size: 16px;\n    line-height: 24px;\n    width: 500px;\n  }\n  p {\n    font-size: 16px;\n    line-height: 22px;\n    margin: 0 0 10px 0;\n    width: 100%;\n  }\n  table, .main, #header, #footer { max-width: 600px; width: 100%; }\n  #header { margin-bottom: 20px; }\n  #issue {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    font-size: 12px;\n    text-align: right;\n  }\n  #issue i { color: #999; font-style: normal; }\n  \n  @media only screen and (max-device-width: 480px) {\n    table, #header, #content, #footer { padding: 0 20px !important; }\n    h1 { font-size: 30px !important; }\n  }\n  \n  @media only screen and (max-device-width: 679px), only screen and (max-width: 679px) {\n    .main { margin: 20px auto; width: 100%; }\n    table, #header, #content, #footer { padding: 0 30px; width: 100%; }\n  \n    #details { padding-right: 10px; }\n  }\n  \n  @media only screen and (min-width: 680px) {\n    body { background: #999 }\n    #details { width: 496px; }\n    .main, table, #header, #content, #footer { background: #FFF; width: 600px; }\n  \n    .main {\n              box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n         -moz-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      -webkit-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      margin: 10px auto 40px;\n      padding: 30px 40px 10px;\n    }\n  }\n\n\n\n\n\n\n\n\nBehold the turtle, he makes progress only when he sticks his neck out. //Bruce Levin\n\n\n\n\n\n\n\n\nhackerbooletter\n\n\n\n\n\n\nIssue #769\n//\n2025-10-31\n//\nView in your browser\n\n\n\n\n\n#Favorites\n//airtable.com\nsponsored\n\n\nUv is the best thing to happen to the Python ecosystem in a decade\n//emily.space comments→\nIt's insulting to read AI-generated blog posts\n//blog.pabloecortez.com comments→\nMinecraft removing obfuscation in Java Edition\n//minecraft.net comments→\nUsing AI to negotiate a $195k hospital bill down to $33k\n//threads.com comments→\nAWS to bare metal two years later: Answering your questions about leaving AWS\n//oneuptime.com comments→\nUnlocking free WiFi on British Airways\n//saxrag.com comments→\nFree software scares normal people\n//danieldelaney.net comments→\nThe Linux Boot Process: From Power Button to Kernel\n//0xkato.xyz comments→\nTinkering is a way to acquire good taste\n//seated.ro comments→\nFeed the bots\n//maurycyz.com comments→\n#Ask HN\nTurned 25, Give Me Your Best Advice for the Next 25 Years?\nAm I the only one not using AI?\n#Classifieds\nDeploy your app before your coffee gets cold. The cloud for developers who ship. Sevalla. $50 free credit. //sevalla.com\nAuthentication and user management, built for B2B SaaS //propelauth.com\nEnd recipe clutter. Scan, import, & generate with AI //grandmasrecipes.app\n👉 Buy a classified ad\n#Show HN\nDiagram as code tool with draggable customizations //github.com comments→\nBash Screensavers //github.com comments→\nIn a single HTML file, an app to encourage my children to invest //roberdam.com comments→\nI made a heatmap diff viewer for code reviews //0github.com comments→\nGrokipedia by xAI //grokipedia.com comments→\nISS in Real Time – 25 Years Aboard the International Space Station //issinrealtime.org comments→\n#Code\nTags to make HTML work like you expect //blog.jim-nielsen.com comments→\nYou already have a Git server //maurycyz.com comments→\nMistakes I see engineers making in their code reviews //seangoedecke.com comments→\nNo Code //github.com comments→\nDjango Keel – 10 Years of Django Best Practices in One Template //github.com comments→\n#Data\nClaude for Excel //claude.com comments→\nKafka is Fast – I'll use Postgres //topicpartition.io comments→\nA sharded DuckDB on 63 nodes runs 1T row aggregation challenge in 5 sec //gizmodata.com comments→\nPlanetScale Offering $5 Databases //planetscale.com comments→\nJSON Query //jsonquerylang.org comments→\nData Centers Are Getting Big //distilled.earth comments→\n#Design\nAffinity Studio now free //affinity.studio comments→\nDithering – Part 1 //visualrambling.space comments→\nSprings and Bounces in Native CSS //joshwcomeau.com comments→\n#Books\nPyrex catalog from from 1938 with hand-drawn lab glassware [pdf] //exhibitdb.cmog.org comments→\nMy favorite cult sci-fi and fantasy books you may not have heard of before //shepherd.com comments→\nIdentifying Life-Changing Books with LLMs //blog.joellehman.com comments→\nEight Million Copies of Moby-Dick //thevoltablog.wordpress.com comments→\n#Working\nWhy I code as a CTO //assembled.com comments→\nAI is making us work more //tawandamunongo.dev comments→\nQuarter of American employees haven't taken a vacation day in the past year //sherwood.news comments→\nGood Managers Write Good //staysaasy.com comments→\n#Learn\nFirst convex polyhedron found that can't pass through itself //quantamagazine.org comments→\nThe ear does not do a Fourier transform //dissonances.blog comments→\nHow to make a Smith chart //johndcook.com comments→\nPhone numbers for use in TV shows, films and creative works //acma.gov.au comments→\nIn memory of the Christmas Island shrew //news.mongabay.com comments→\n987654321 / 123456789 //johndcook.com comments→\n#Watching\n10M people watched a YouTuber shim a lock; the lock company sued him – bad idea //arstechnica.com comments→\nJujutsu at Google //youtube.com comments→\nUnderdetermined Weaving with Machines //youtube.com comments→\n#Startup News\nWillow quantum chip demonstrates verifiable quantum advantage on hardware //blog.google comments→\nThe next chapter of the Microsoft–OpenAI partnership //openai.com comments→\nNvidia takes $1B stake in Nokia //cnbc.com comments→\nGrammarly rebrands to 'Superhuman,' launches a new AI assistant //techcrunch.com comments→\nAlphabet tops $100B quarterly revenue for first time, cloud grows 34% //cnbc.com comments→\nApple reports fourth quarter results //apple.com comments→\n#Fun\nAdvent of Code 2025: Number of puzzles reduce from 25 to 12 for the first time //adventofcode.com comments→\nPoker Tournament for LLMs //pokerbattle.ai comments→\nConnect to a 1980s Atari BBS through the web //southernamis.com comments→\nRecreating a Homebrew Game System from 1987 //alex-j-lowry.github.io comments→\n3D printed maquette of Amsterdam on scale 1:2000 //at5.nl comments→\n__END__\nCurpress\nfrom Bellingham, Washington. Hacker Newsletter is not affiliated with Y Combinator in any way.\n\n\n💡 Need to disconnect?\nUnsubscribe\n\n\n✨ Want to promote your startup?\nBuy a classified ad\nor click reply to get our media kit\n\n\n⭐ Not a subscriber? Subscribe at\nhttps://hackernewsletter.com",
                    "newsPublishDate": "2025-10-31T11:00:00.000Z",
                    "newsLink": "https://buttondown.com/hacker-newsletter/archive/769/"
                },
                {
                    "newsTitle": "Hacker Newsletter #768",
                    "newsContentSnippet": "body { background: #FFF; }\n  body, h1, h2, h3, p, table, tr, td {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    margin: 0;\n    padding: 0;\n  }\n  .main, table { background-color: #FFFFFF; }\n  a { color: #1786C1; text-decoration: underline; }\n  a:hover { text-decoration: none; }\n  h1 {\n    font-size: 35px;\n    margin-bottom: 5px;\n    padding-top: 10px;\n    width: 100%;\n  }\n  h1 a { color: #333; text-decoration: none; }\n  h1 a:hover { color: #666; text-decoration: underline; }\n  h2 {\n    color: #cc0000;\n    font-size: 16px;\n    font-weight: bold;\n    margin: 20px 0 10px;\n  }\n  h3 {\n    border-bottom: 1px solid #333;\n    border-top: 3px solid #333;\n    font-size: 16px;\n    font-weight: normal;\n    line-height: 22px;\n    margin: 20px 0;\n    padding: 20px 0;\n  }\n  p {\n    color: #333;\n    font-size: 16px;\n    line-height: 24px;\n    width: 500px;\n  }\n  p {\n    font-size: 16px;\n    line-height: 22px;\n    margin: 0 0 10px 0;\n    width: 100%;\n  }\n  table, .main, #header, #footer { max-width: 600px; width: 100%; }\n  #header { margin-bottom: 20px; }\n  #issue {\n    color: #333;\n    font-family: ubuntu, Helvetica, \"Lucida Grande\", Arial, sans-serif;\n    font-size: 12px;\n    text-align: right;\n  }\n  #issue i { color: #999; font-style: normal; }\n  \n  @media only screen and (max-device-width: 480px) {\n    table, #header, #content, #footer { padding: 0 20px !important; }\n    h1 { font-size: 30px !important; }\n  }\n  \n  @media only screen and (max-device-width: 679px), only screen and (max-width: 679px) {\n    .main { margin: 20px auto; width: 100%; }\n    table, #header, #content, #footer { padding: 0 30px; width: 100%; }\n  \n    #details { padding-right: 10px; }\n  }\n  \n  @media only screen and (min-width: 680px) {\n    body { background: #999 }\n    #details { width: 496px; }\n    .main, table, #header, #content, #footer { background: #FFF; width: 600px; }\n  \n    .main {\n              box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n         -moz-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      -webkit-box-shadow: 0 0 12px rgba(0, 0, 0, .6);\n      margin: 10px auto 40px;\n      padding: 30px 40px 10px;\n    }\n  }\n\n\n\n\n\n\n\n\nThe world always seems brighter when you've just made something that wasn't there before. //Neil Gaiman\n\n\n\n\n\n\n\n\nhackernewsletter\n\n\n\n\n\n\nIssue #768\n//\n2025-10-24\n//\nView in your browser\n\n\n\n\n\n#Favorites\nAWS multiple services outage in us-east-1 (and postmortem)\n//health.aws.amazon.com comments→\nScripts I wrote that I use all the time\n//evanhahn.com comments→\nAndrej Karpathy – It will take a decade to work through the issues with agents\n//dwarkesh.com comments→\nMigrating from AWS to Hetzner\n//digitalsociety.coop comments→\nThe Rapper 50 Cent, Adjusted for Inflation\n//50centadjustedforinflation.com comments→\nClaude Skills are awesome, maybe a bigger deal than MCP\n//simonwillison.net comments→\nBuild your own database\n//nan.fyi comments→\nProgramming with Less Than Nothing\n//joshmoody.org comments→\n./watch\n//dotslashwatch.com comments→\nThe Lottery-fication of Everything\n//dopaminemarkets.com comments→\nThe Spilhaus Projection-A World Map According to Fish\n//southernwoodenboatsailing.com comments→\nDerek Sivers's database and web apps\n//github.com comments→\n#Ask HN\nHow to stop an AWS bot sending 2B requests/month?\nOur AWS account got compromised after their outage\nWhat are some impressive vibe coding projects?\n#Classifieds\nDeploy your app before your coffee gets cold. The cloud for developers who ship. Sevalla. $50 free credit. //sevalla.com\nAutomate your business with AI agents with Tasklet //tasklet.ai\nNango - Integrate your product or AI agent with 500+ APIs //nango.dev\n☝️ Never forget birthdays. Automate: WhatsApp, Signal, Telegram.... //schedulemessages.online\nBook a classified ad for $150 //airtable.com\n#Show HN\nRivian's TM-B electric bike //theverge.com comments→\nRoc Camera //roc.camera comments→\nI built a tech news aggregator that works the way my brain does //deadstack.net comments→\nOpenSnowcat – A fork of Snowplow to keep open analytics alive //opensnowcat.io comments→\nSilly Morse code chat app using WebSockets //noamtamir.github.io comments→\n#Code\nIDEs we had 30 years ago and lost //blogsystem5.substack.com comments→\nForth: The programming language that writes itself //ratfactor.com comments→\nWhy I Chose Elixir Phoenix over Rails, Laravel, and Next.js //akarshc.com comments→\nLiving Dangerously with Claude //simonwillison.net comments→\nGo Subtleties You May Not Know //harrisoncramer.me comments→\n#Data\nDeepSeek OCR //github.com comments→\nSQL Anti-Patterns //datamethods.substack.com comments→\n/dev/null is an ACID compliant database //jyu.dev comments→\nHow count-min sketches work – frequencies, but without the actual data //instantdb.com comments→\n#Design\nWhat happened to Apple's legendary attention to detail? //blog.johnozbay.com comments→\nNew Work by Gary Larson //thefarside.com comments→\nASCII Automata //hlnet.neocities.org comments→\nOur Paint – a featureless but programmable painting program //WellObserve.com comments→\n#Books\nFree Programing Books //github.com comments→\n20,858 Public Domain Audio Books //librivox.org comments→\n#Learn\nWhat Americans die from vs. what the news reports on //ourworldindata.org comments→\nDoing well in your courses: Andrej's advice for success //cs.stanford.edu comments→\nRoot System Drawings //images.wur.nl comments→\n60k kids have avoided peanut allergies due to 2015 advice, study finds //cbsnews.com comments→\nRadios, how do they work? //lcamtuf.substack.com comments→\nThe game theory of how algorithms can drive up prices //quantamagazine.org comments→\n#Watching\nA laser pointer at 2B FPS //youtube.com comments→\nLive Stream from the Namib Desert //bookofjoe2.blogspot.com comments→\nEQ: A video about all forms of equalizers //youtube.com comments→\nThe Hidden Engineering of Niagara Falls //practical.engineering comments→\nMIT 6.001 Structure and Interpretation of Computer Programs, Lecture 1A //youtube.com comments→\n#Startup News\nChatGPT Atlas //chatgpt.com comments→\nAmazon’s Ring to partner with Flock //techcrunch.com comments→\nMeta is axing 600 roles across its AI division //theverge.com comments→\nLanguage Support for Marginalia Search //marginalia.nu comments→\nOpenAI acquires Sky.app //openai.com comments→\n#Fun\nSpace Elevator //neal.fun comments→\nReplacement.ai //replacement.ai comments→\nI'm making a detective game built on Wikipedia //detective.wiki comments→\nStarGrid: A new Palm OS strategy game //quarters.captaintouch.com comments→\nDoomsday scoreboard //doomsday.march1studios.com comments→\nC64 Blood Money //lemmings.info comments→\nMetropolis 1998 lets you design every building in an isometric, pixel-art city //arstechnica.com comments→\nSolving the NYTimes Pips puzzle with a constraint solver //righto.com comments→\nPlay abstract strategy board games online with friends or against bots //abstractboardgames.com comments→\n__END__\nCurpress\nfrom Bellingham, Washington. Hacker Newsletter is not affiliated with Y Combinator in any way.\n\n\n💡 Need to disconnect?\nUnsubscribe\n\n\n✨ Want to promote your startup?\nBuy a classified ad\nor click reply to get our media kit\n\n\n⭐ Not a subscriber? Subscribe at\nhttps://hackernewsletter.com",
                    "newsPublishDate": "2025-10-24T11:15:00.000Z",
                    "newsLink": "https://buttondown.com/hacker-newsletter/archive/768/"
                },
                {
                    "newsTitle": "從零開始學習TypeScript Day4",
                    "newsContentSnippet": "Union Types（聯合型別）\nContinue reading on Medium »",
                    "newsPublishDate": "2025-11-29T16:42:21.000Z",
                    "newsLink": "https://medium.com/@a86527913/%E5%BE%9E%E9%9B%B6%E9%96%8B%E5%A7%8B%E5%AD%B8%E7%BF%92typescript-day4-6624a10e6d5d?source=rss------typescript-5"
                },
                {
                    "newsTitle": "The Hardest Part About Choosing TypeScript Is Admitting When Plain JavaScript Beats It",
                    "newsContentSnippet": "A grounded, experience-driven breakdown of when TypeScript accelerates development and when JavaScript saves your sanity.\nContinue reading on JavaScript in Plain English »",
                    "newsPublishDate": "2025-11-29T14:51:34.000Z",
                    "newsLink": "https://javascript.plainenglish.io/typescript-or-javascript-which-one-actually-makes-you-faster-27315efc60f2?source=rss------typescript-5"
                },
                {
                    "newsTitle": "Kubernetes v1.35 Sneak Peek",
                    "newsContentSnippet": "As the release of Kubernetes v1.35 approaches, the Kubernetes project continues to evolve. Features may be deprecated, removed, or replaced to improve the project's overall health. This blog post outlines planned changes for the v1.35 release that the release team believes you should be aware of to ensure the continued smooth operation of your Kubernetes cluster(s), and to keep you up to date with the latest developments. The information below is based on the current status of the v1.35 release and is subject to change before the final release date.\nDeprecations and removals for Kubernetes v1.35\ncgroup v1 support\nOn Linux nodes, container runtimes typically rely on cgroups (short for \"control groups\").\nSupport for using cgroup v2 has been stable in Kubernetes since v1.25, providing an alternative to the original v1 cgroup support. While cgroup v1 provided the initial resource control mechanism, it suffered from well-known\ninconsistencies and limitations. Adding support for cgroup v2 allowed use of a unified control group hierarchy, improved resource isolation, and served as the foundation for modern features, making legacy cgroup v1 support ready for removal.\nThe removal of cgroup v1 support will only impact cluster administrators running nodes on older Linux distributions that do not support cgroup v2; on those nodes, the kubelet will fail to start. Administrators must migrate their nodes to systems with cgroup v2 enabled. More details on compatibility requirements will be available in a blog post soon after the v1.35 release.\nTo learn more, read about cgroup v2;\nKEP-5573: Remove cgroup v1 support.\nDeprecation of ipvs mode in kube-proxy\nMany releases ago, the Kubernetes project implemented an ipvs mode in kube-proxy. It was adopted as a way to provide high-performance service load balancing, with better performance than the existing iptables mode. However, maintaining feature parity between ipvs and other kube-proxy modes became difficult, due to technical complexity and diverging requirements. This created significant technical debt and made the ipvs backend impractical to support alongside newer networking capabilities.\nThe Kubernetes project intends to deprecate kube-proxy ipvs mode in the v1.35 release, to streamline the kube-proxy codebase. For Linux nodes, the recommended kube-proxy mode is already nftables.\nYou can find more in KEP-5495: Deprecate ipvs mode in kube-proxy\nKubernetes is deprecating containerd v1.y support\nWhile Kubernetes v1.35 still supports containerd 1.7 and other LTS releases of containerd, as a consequence of automated cgroup driver detection, the Kubernetes SIG Node community has formally agreed upon a final support timeline for containerd v1.X. Kubernetes v1.35 is the last release to offer this support (aligned with containerd 1.7 EOL).\nThis is a final warning that if you are using containerd 1.X, you must switch to 2.0 or later before upgrading Kubernetes to the next version. You are able to monitor the kubelet_cri_losing_support metric to determine if any nodes in your cluster are using a containerd version that will soon be unsupported.\nYou can find more in the official blog post or in KEP-4033: Discover cgroup driver from CRI\nFeatured enhancements of Kubernetes v1.35\nThe following enhancements are some of those likely to be included in the v1.35 release. This is not a commitment, and the release content is subject to change.\nNode declared features\nWhen scheduling Pods, Kubernetes uses node labels, taints, and tolerations to match workload requirements with node capabilities. However, managing feature compatibility becomes challenging during cluster upgrades due to version skew between the control plane and nodes. This can lead to Pods being scheduled on nodes that lack required features, resulting in runtime failures.\nThe node declared features framework will introduce a standard mechanism for nodes to declare their supported Kubernetes features. With the new alpha feature enabled, a Node reports the features it can support, publishing this information to the control plane through a new .status.declaredFeatures field. Then, the kube-scheduler, admission controllers and third-party components can use these declarations. For example, you can enforce scheduling and API validation constraints, ensuring that Pods run only on compatible nodes.\nThis approach reduces manual node labeling, improves scheduling accuracy, and prevents incompatible pod placements proactively. It also integrates with the Cluster Autoscaler for informed scale-up decisions. Feature declarations are temporary and tied to Kubernetes feature gates, enabling safe rollout and cleanup.\nTargeting alpha in v1.35, node declared features aims to solve version skew scheduling issues by making node capabilities explicit, enhancing reliability and cluster stability in heterogeneous version environments.\nTo learn more about this before the official documentation is published, you can read KEP-5328.\nIn-place update of Pod resources\nKubernetes is graduating in-place updates for Pod resources to General Availability (GA). This feature allows users to adjust cpu and memory resources without restarting Pods or Containers. Previously, such modifications required recreating Pods, which could disrupt workloads, particularly for stateful or batch applications.\nPrevious Kubernetes releases already allowed you to change infrastructure resources settings (requests and limits) for existing Pods. This allows for smoother vertical scaling, improves efficiency, and can also simplify solution development.\nThe Container Runtime Interface (CRI) has also been improved, extending the UpdateContainerResources API for Windows and future runtimes while allowing ContainerStatus to report real-time resource configurations. Together, these changes make scaling in Kubernetes faster, more flexible, and disruption-free.\nThe feature was introduced as alpha in v1.27, graduated to beta in v1.33, and is targeting graduation to stable in v1.35.\nYou can find more in KEP-1287: In-place Update of Pod Resources\nPod certificates\nWhen running microservices, Pods often require a strong cryptographic identity to authenticate with each other using mutual TLS (mTLS). While Kubernetes provides Service Account tokens, these are designed for authenticating to the API server, not for general-purpose workload identity.\nBefore this enhancement, operators had to rely on complex, external projects like SPIFFE/SPIRE or cert-manager to provision and rotate certificates for their workloads. But what if you could issue a unique, short-lived certificate to your Pods natively and automatically? KEP-4317 is designed to enable such native workload identity. It opens up various possibilities for securing pod-to-pod communication by allowing the kubelet to request and mount certificates for a Pod via a projected volume.\nThis provides a built-in mechanism for workload identity, complete with automated certificate rotation, significantly simplifying the setup of service meshes and other zero-trust network policies. This feature was introduced as alpha in v1.34 and is targeting beta in v1.35.\nYou can find more in KEP-4317: Pod Certificates\nNumeric values for taints\nKubernetes is enhancing taints and tolerations by adding numeric comparison operators, such as Gt (Greater Than) and Lt (Less Than).\nPreviously, tolerations supported only exact (Equal) or existence (Exists) matches, which were not suitable for numeric properties such as reliability SLAs.\nWith this change, a Pod can use a toleration to \"opt-in\" to nodes that meet a specific numeric threshold. For example, a Pod can require a Node with an SLA taint value greater than 950 (operator: Gt, value: \"950\").\nThis approach is more powerful than Node Affinity because it supports the NoExecute effect, allowing Pods to be automatically evicted if a node's numeric value drops below the tolerated threshold.\nYou can find more in KEP-5471: Enable SLA-based Scheduling\nUser namespaces\nWhen running Pods, you can use securityContext to drop privileges, but containers inside the pod often still run as root (UID 0). This simplicity poses a significant challenge, as that container UID 0 maps directly to the host's root user.\nBefore this enhancement, a container breakout vulnerability could grant an attacker full root access to the node. But what if you could dynamically remap the container's root user to a safe, unprivileged user on the host? KEP-127 specifically allows such native support for Linux User Namespaces. It opens up various possibilities for pod security by isolating container and host user/group IDs. This allows a process to have root privileges (UID 0) within its namespace, while running as a non-privileged, high-numbered UID on the host.\nReleased as alpha in v1.25 and beta in v1.30, this feature continues to progress through beta maturity, paving the way for truly \"rootless\" containers that drastically reduce the attack surface for a whole class of security vulnerabilities.\nYou can find more in KEP-127: User Namespaces\nSupport for mounting OCI images as volumes\nWhen provisioning a Pod, you often need to bundle data, binaries, or configuration files for your containers.\nBefore this enhancement, people often included that kind of data directly into the main container image, or required a custom init container to download and unpack files into an emptyDir. You can still take either of those approaches, of course.\nBut what if you could populate a volume directly from a data-only artifact in an OCI registry, just like pulling a container image? Kubernetes v1.31 added support for the image volume type, allowing Pods to pull and unpack OCI container image artifacts into a volume declaratively.\nThis allows for seamless distribution of data, binaries, or ML models using standard registry tooling, completely decoupling data from the container image and eliminating the need for complex init containers or startup scripts.\nThis volume type has been in beta since v1.33 and will likely be enabled by default in v1.35.\nYou can try out the beta version of image volumes, or you can learn more about the plans from KEP-4639: OCI Volume Source.\nWant to know more?\nNew features and deprecations are also announced in the Kubernetes release notes. We will formally announce what's new in Kubernetes v1.35 as part of the CHANGELOG for that release.\nThe Kubernetes v1.35 release is planned for December 17, 2025. Stay tuned for updates!\nYou can also see the announcements of changes in the release notes for:\nKubernetes v1.34\nKubernetes v1.33\nKubernetes v1.32\nKubernetes v1.31\nKubernetes v1.30\nGet involved\nThe simplest way to get involved with Kubernetes is by joining one of the many Special Interest Groups (SIGs) that align with your interests. Have something you’d like to broadcast to the Kubernetes community? Share your voice at our weekly community meeting, and through the channels below. Thank you for your continued feedback and support.\nFollow us on Bluesky @kubernetes.io for the latest updates\nJoin the community discussion on Discuss\nJoin the community on Slack\nPost questions (or answer questions) on Server Fault or Stack Overflow\nShare your Kubernetes story\nRead more about what’s happening with Kubernetes on the blog\nLearn more about the Kubernetes Release Team",
                    "newsPublishDate": "2025-11-26T00:00:00.000Z",
                    "newsLink": "https://kubernetes.io/blog/2025/11/26/kubernetes-v1-35-sneak-peek/"
                },
                {
                    "newsTitle": "Kubernetes Configuration Good Practices",
                    "newsContentSnippet": "Configuration is one of those things in Kubernetes that seems small until it's not. Configuration is at the heart of every Kubernetes workload.\nA missing quote, a wrong API version or a misplaced YAML indent can ruin your entire deploy.\nThis blog brings together tried-and-tested configuration best practices. The small habits that make your Kubernetes setup clean, consistent and easier to manage.\nWhether you are just starting out or already deploying apps daily, these are the little things that keep your cluster stable and your future self sane.\nThis blog is inspired by the original Configuration Best Practices page, which has evolved through contributions from many members of the Kubernetes community.\nGeneral configuration practices\nUse the latest stable API version\nKubernetes evolves fast. Older APIs eventually get deprecated and stop working. So, whenever you are defining resources, make sure you are using the latest stable API version.\nYou can always check with\nkubectl api-resources\n\n\nThis simple step saves you from future compatibility issues.\nStore configuration in version control\nNever apply manifest files directly from your desktop. Always keep them in a version control system like Git, it's your safety net.\nIf something breaks, you can instantly roll back to a previous commit, compare changes or recreate your cluster setup without panic.\nWrite configs in YAML not JSON\nWrite your configuration files using YAML rather than JSON. Both work technically, but YAML is just easier for humans. It's cleaner to read and less noisy and widely used in the community.\nYAML has some sneaky gotchas with boolean values:\nUse only true or false.\nDon't write yes, no, on or off.\nThey might work in one version of YAML but break in another. To be safe, quote anything that looks like a Boolean (for example \"yes\").\nKeep configuration simple and minimal\nAvoid setting default values that are already handled by Kubernetes. Minimal manifests are easier to debug, cleaner to review and less likely to break things later.\nGroup related objects together\nIf your Deployment, Service and ConfigMap all belong to one app, put them in a single manifest file.\nGuestbook all-in-one.yaml file for an example of this syntax.\nYou can even apply entire directories with:\nkubectl apply -f configs/\n\n\nOne command and boom everything in that folder gets deployed.\nAdd helpful annotations\nManifest files are not just for machines, they are for humans too. Use annotations to describe why something exists or what it does. A quick one-liner can save hours when debugging later and also allows better collaboration.\nThe most helpful annotation to set is kubernetes.io/description. It's like using comment, except that it gets copied into the API so that everyone else can see it even after you deploy.\nManaging Workloads: Pods, Deployments, and Jobs\nA common early mistake in Kubernetes is creating Pods directly. Pods work, but they don't reschedule themselves if something goes wrong.\nNaked Pods (Pods not managed by a controller, such as Deployment or a StatefulSet) are fine for testing, but in real setups, they are risky.\nWhy?\nBecause if the node hosting that Pod dies, the Pod dies with it and Kubernetes won't bring it back automatically.\nUse Deployments for apps that should always be running\nA Deployment, which both creates a ReplicaSet to ensure that the desired number of Pods is always available, and specifies a strategy to replace Pods (such as RollingUpdate), is almost always preferable to creating Pods directly.\nYou can roll out a new version, and if something breaks, roll back instantly.\nUse Jobs for tasks that should finish\nA Job is perfect when you need something to run once and then stop like database migration or batch processing task.\nIt will retry if the pods fails and report success when it's done.\nService Configuration and Networking\nServices are how your workloads talk to each other inside (and sometimes outside) your cluster. Without them, your pods exist but can't reach anyone. Let's make sure that doesn't happen.\nCreate Services before workloads that use them\nWhen Kubernetes starts a Pod, it automatically injects environment variables for existing Services.\nSo, if a Pod depends on a Service, create a Service before its corresponding backend workloads (Deployments or StatefulSets), and before any workloads that need to access it.\nFor example, if a Service named foo exists, all containers will get the following variables in their initial environment:\nFOO_SERVICE_HOST=<the host the Service runs on>\nFOO_SERVICE_PORT=<the port the Service runs on>\n\nDNS based discovery doesn't have this problem, but it's a good habit to follow anyway.\nUse DNS for Service discovery\nIf your cluster has the DNS add-on (most do), every Service automatically gets a DNS entry. That means you can access it by name instead of IP:\ncurl http://my-service.default.svc.cluster.local\n\n\nIt's one of those features that makes Kubernetes networking feel magical.\nAvoid hostPort and hostNetwork unless absolutely necessary\nYou'll sometimes see these options in manifests:\nhostPort: 8080\nhostNetwork: true\n\n\nBut here's the thing:\nThey tie your Pods to specific nodes, making them harder to schedule and scale. Because each <hostIP, hostPort, protocol> combination must be unique. If you don't specify the hostIP and protocol explicitly, Kubernetes will use 0.0.0.0 as the default hostIP and TCP as the default protocol.\nUnless you're debugging or building something like a network plugin, avoid them.\nIf you just need local access for testing, try kubectl port-forward:\nkubectl port-forward deployment/web 8080:80\n\n\nSee Use Port Forwarding to access applications in a cluster to learn more.\nOr if you really need external access, use a type: NodePort Service. That's the safer, Kubernetes-native way.\nUse headless Services for internal discovery\nSometimes, you don't want Kubernetes to load balance traffic. You want to talk directly to each Pod. That's where headless Services come in.\nYou create one by setting clusterIP: None.\nInstead of a single IP, DNS gives you a list of all Pods IPs, perfect for apps that manage connections themselves.\nWorking with labels effectively\nLabels are key/value pairs that are attached to objects such as Pods.\nLabels help you organize, query and group your resources.\nThey don't do anything by themselves, but they make everything else from Services to Deployments work together smoothly.\nUse semantics labels\nGood labels help you understand what's what, even after months later.\nDefine and use labels that identify semantic attributes of your application or Deployment.\nFor example;\nlabels:\n app.kubernetes.io/name: myapp\n app.kubernetes.io/component: web\n tier: frontend\n phase: test\n\n\napp.kubernetes.io/name : what the app is\ntier : which layer it belongs to (frontend/backend)\nphase : which stage it's in (test/prod)\nYou can then use these labels to make powerful selectors.\nFor example:\nkubectl get pods -l tier=frontend\n\n\nThis will list all frontend Pods across your cluster, no matter which Deployment they came from.\nBasically you are not manually listing Pod names; you are just describing what you want.\nSee the guestbook app for examples of this approach.\nUse common Kubernetes labels\nKubernetes actually recommends a set of common labels. It's a standardized way to name things across your different workloads or projects.\nFollowing this convention makes your manifests cleaner, and it means that tools such as Headlamp, dashboard, or third-party monitoring systems can all\nautomatically understand what's running.\nManipulate labels for debugging\nSince controllers (like ReplicaSets or Deployments) use labels to manage Pods, you can remove a label to “detach” a Pod temporarily.\nExample:\nkubectl label pod mypod app-\n\n\nThe app- part removes the label key app.\nOnce that happens, the controller won’t manage that Pod anymore.\nIt’s like isolating it for inspection, a “quarantine mode” for debugging. To interactively remove or add labels, use kubectl label.\nYou can then check logs, exec into it and once done, delete it manually.\nThat’s a super underrated trick every Kubernetes engineer should know.\nHandy kubectl tips\nThese small tips make life much easier when you are working with multiple manifest files or clusters.\nApply entire directories\nInstead of applying one file at a time, apply the whole folder:\n# Using server-side apply is also a good practice\nkubectl apply -f configs/ --server-side\n\n\nThis command looks for .yaml, .yml and .json files in that folder and applies them all together.\nIt's faster, cleaner and helps keep things grouped by app.\nUse label selectors to get or delete resources\nYou don't always need to type out resource names one by one.\nInstead, use selectors to act on entire groups at once:\nkubectl get pods -l app=myapp\nkubectl delete pod -l phase=test\n\n\nIt's especially useful in CI/CD pipelines, where you want to clean up test resources dynamically.\nQuickly create Deployments and Services\nFor quick experiments, you don't always need to write a manifest. You can spin up a Deployment right from the CLI:\nkubectl create deployment webapp --image=nginx\n\n\nThen expose it as a Service:\nkubectl expose deployment webapp --port=80\n\n\nThis is great when you just want to test something before writing full manifests.\nAlso, see Use a Service to Access an Application in a cluster for an example.\nConclusion\nCleaner configuration leads to calmer cluster administrators.\nIf you stick to a few simple habits: keep configuration simple and minimal, version-control everything,\nuse consistent labels, and avoid relying on naked Pods, you'll save yourself hours of debugging down the road.\nThe best part?\nClean configurations stay readable. Even after months, you or anyone on your team can glance at them and know exactly what’s happening.",
                    "newsPublishDate": "2025-11-25T00:00:00.000Z",
                    "newsLink": "https://kubernetes.io/blog/2025/11/25/configuration-good-practices/"
                },
                {
                    "newsTitle": "Ingress NGINX Retirement: What You Need to Know",
                    "newsContentSnippet": "To prioritize the safety and security of the ecosystem, Kubernetes SIG Network and the Security Response Committee are announcing the upcoming retirement of Ingress NGINX. Best-effort maintenance will continue until March 2026. Afterward, there will be no further releases, no bugfixes, and no updates to resolve any security vulnerabilities that may be discovered. Existing deployments of Ingress NGINX will continue to function and installation artifacts will remain available.\nWe recommend migrating to one of the many alternatives. Consider migrating to Gateway API, the modern replacement for Ingress. If you must continue using Ingress, many alternative Ingress controllers are listed in the Kubernetes documentation. Continue reading for further information about the history and current state of Ingress NGINX, as well as next steps.\nAbout Ingress NGINX\nIngress is the original user-friendly way to direct network traffic to workloads running on Kubernetes. (Gateway API is a newer way to achieve many of the same goals.) In order for an Ingress to work in your cluster, there must be an Ingress controller running. There are many Ingress controller choices available, which serve the needs of different users and use cases. Some are cloud-provider specific, while others have more general applicability.\nIngress NGINX was an Ingress controller, developed early in the history of the Kubernetes project as an example implementation of the API. It became very popular due to its tremendous flexibility, breadth of features, and independence from any particular cloud or infrastructure provider. Since those days, many other Ingress controllers have been created within the Kubernetes project by community groups, and by cloud native vendors. Ingress NGINX has continued to be one of the most popular, deployed as part of many hosted Kubernetes platforms and within innumerable independent users’ clusters.\nHistory and Challenges\nThe breadth and flexibility of Ingress NGINX has caused maintenance challenges. Changing expectations about cloud native software have also added complications. What were once considered helpful options have sometimes come to be considered serious security flaws, such as the ability to add arbitrary NGINX configuration directives via the \"snippets\" annotations. Yesterday’s flexibility has become today’s insurmountable technical debt.\nDespite the project’s popularity among users, Ingress NGINX has always struggled with insufficient or barely-sufficient maintainership. For years, the project has had only one or two people doing development work, on their own time, after work hours and on weekends. Last year, the Ingress NGINX maintainers announced their plans to wind down Ingress NGINX and develop a replacement controller together with the Gateway API community. Unfortunately, even that announcement failed to generate additional interest in helping maintain Ingress NGINX or develop InGate to replace it. (InGate development never progressed far enough to create a mature replacement; it will also be retired.)\nCurrent State and Next Steps\nCurrently, Ingress NGINX is receiving best-effort maintenance. SIG Network and the Security Response Committee have exhausted our efforts to find additional support to make Ingress NGINX sustainable. To prioritize user safety, we must retire the project.\nIn March 2026, Ingress NGINX maintenance will be halted, and the project will be retired. After that time, there will be no further releases, no bugfixes, and no updates to resolve any security vulnerabilities that may be discovered. The GitHub repositories will be made read-only and left available for reference.\nExisting deployments of Ingress NGINX will not be broken. Existing project artifacts such as Helm charts and container images will remain available.\nIn most cases, you can check whether you use Ingress NGINX by running kubectl get pods \\--all-namespaces \\--selector app.kubernetes.io/name=ingress-nginx with cluster administrator permissions.\nWe would like to thank the Ingress NGINX maintainers for their work in creating and maintaining this project–their dedication remains impressive. This Ingress controller has powered billions of requests in datacenters and homelabs all around the world. In a lot of ways, Kubernetes wouldn’t be where it is without Ingress NGINX, and we are grateful for so many years of incredible effort.\nSIG Network and the Security Response Committee recommend that all Ingress NGINX users begin migration to Gateway API or another Ingress controller immediately. Many options are listed in the Kubernetes documentation: Gateway API, Ingress. Additional options may be available from vendors you work with.",
                    "newsPublishDate": "2025-11-11T18:30:00.000Z",
                    "newsLink": "https://kubernetes.io/blog/2025/11/11/ingress-nginx-retirement/"
                },
                {
                    "newsTitle": "Announcing the 2025 Steering Committee Election Results",
                    "newsContentSnippet": "The 2025 Steering Committee Election is now complete. The Kubernetes Steering Committee consists of 7 seats, 4 of which were up for election in 2025. Incoming committee members serve a term of 2 years, and all members are elected by the Kubernetes Community.\nThe Steering Committee oversees the governance of the entire Kubernetes project. With that great power comes great responsibility. You can learn more about the steering committee’s role in their charter.\nThank you to everyone who voted in the election; your participation helps support the community’s continued health and success.\nResults\nCongratulations to the elected committee members whose two year terms begin immediately (listed in alphabetical order by GitHub handle):\nKat Cosgrove (@katcosgrove), Minimus\nPaco Xu (@pacoxu), DaoCloud\nRita Zhang (@ritazh), Microsoft\nMaciej Szulik (@soltysh), Defense Unicorns\nThey join continuing members:\nAntonio Ojea (@aojea), Google\nBenjamin Elder (@BenTheElder), Google\nSascha Grunert (@saschagrunert), Red Hat\nMaciej Szulik and Paco Xu are returning Steering Committee Members.\nBig thanks!\nThank you and congratulations on a successful election to this round’s election officers:\nChristoph Blecker (@cblecker)\nNina Polshakova (@npolshakova)\nSreeram Venkitesh (@sreeram-venkitesh)\nThanks to the Emeritus Steering Committee Members. Your service is appreciated by the community:\nStephen Augustus (@justaugustus), Bloomberg\nPatrick Ohly (@pohly), Intel\nAnd thank you to all the candidates who came forward to run for election.\nGet involved with the Steering Committee\nThis governing body, like all of Kubernetes, is open to all. You can follow along with Steering Committee meeting notes and weigh in by filing an issue or creating a PR against their repo. They have an open meeting on the first Wednesday at 8am PT of every month. They can also be contacted at their public mailing list steering@kubernetes.io.\nYou can see what the Steering Committee meetings are all about by watching past meetings on the YouTube Playlist.\nThis post was adapted from one written by the Contributor Comms Subproject. If you want to write stories about the Kubernetes community, learn more about us.\nThis article was revised in November 2025 to update the information about when the steering committee meets.",
                    "newsPublishDate": "2025-11-09T20:10:00.000Z",
                    "newsLink": "https://kubernetes.io/blog/2025/11/09/steering-committee-results-2025/"
                },
                {
                    "newsTitle": "Gateway API 1.4: New Features",
                    "newsContentSnippet": "Ready to rock your Kubernetes networking? The Kubernetes SIG Network community presented the General Availability (GA) release of Gateway API (v1.4.0)! Released on October 6, 2025, version 1.4.0 reinforces the path for modern, expressive, and extensible service networking in Kubernetes.\nGateway API v1.4.0 brings three new features to the Standard channel\n(Gateway API's GA release channel):\nBackendTLSPolicy for TLS between gateways and backends\nsupportedFeatures in GatewayClass status\nNamed rules for Routes\nand introduces three new experimental features:\nMesh resource for service mesh configuration\nDefault gateways to ease configuration burden**\nexternalAuth filter for HTTPRoute\nGraduations to Standard Channel\nBackend TLS policy\nLeads: Candace Holman, Norwin Schnyder, Katarzyna Łach\nGEP-1897: BackendTLSPolicy\nBackendTLSPolicy is a new Gateway API type for specifying the TLS configuration\nof the connection from the Gateway to backend pod(s).\n. Prior to the introduction of BackendTLSPolicy, there was no API specification\nthat allowed encrypted traffic on the hop from Gateway to backend.\nThe BackendTLSPolicy validation configuration requires a hostname. This hostname\nserves two purposes. It is used as the SNI header when connecting to the backend and\nfor authentication, the certificate presented by the backend must match this hostname,\nunless subjectAltNames is explicitly specified.\nIf subjectAltNames (SANs) are specified, the hostname is only used for SNI, and authentication is performed against the SANs instead. If you still need to authenticate against the hostname value in this case, you MUST add it to the subjectAltNames list.\nBackendTLSPolicy validation configuration also requires either caCertificateRefs or wellKnownCACertificates.\ncaCertificateRefs refer to one or more (up to 8) PEM-encoded TLS certificate bundles. If there are no specific certificates to use,\nthen depending on your implementation, you may use wellKnownCACertificates,\nset to \"System\" to tell the Gateway to use an implementation-specific set of trusted CA Certificates.\nIn this example, the BackendTLSPolicy is configured to use certificates defined in the auth-cert ConfigMap\nto connect with a TLS-encrypted upstream connection where pods backing the auth service are expected to serve a\nvalid certificate for auth.example.com. It uses subjectAltNames with a Hostname type, but you may also use a URI type.\napiVersion: gateway.networking.k8s.io/v1\nkind: BackendTLSPolicy\nmetadata:\n name: tls-upstream-auth\nspec:\n targetRefs:\n - kind: Service\n name: auth\n group: \"\"\n sectionName: \"https\"\n validation:\n caCertificateRefs:\n - group: \"\" # core API group\n kind: ConfigMap\n name: auth-cert\n subjectAltNames:\n - type: \"Hostname\"\n hostname: \"auth.example.com\"\n\n\nIn this example, the BackendTLSPolicy is configured to use system certificates to connect with a TLS-encrypted backend connection where Pods backing the dev Service are expected to serve a valid certificate for dev.example.com.\napiVersion: gateway.networking.k8s.io/v1\nkind: BackendTLSPolicy\nmetadata:\n name: tls-upstream-dev\nspec:\n targetRefs:\n - kind: Service\n name: dev\n group: \"\"\n sectionName: \"btls\"\n validation:\n wellKnownCACertificates: \"System\"\n hostname: dev.example.com\n\n\nMore information on the configuration of TLS in Gateway API can be found in Gateway API - TLS Configuration.\nStatus information about the features that an implementation supports\nLeads: Lior Lieberman, Beka Modebadze\nGEP-2162: Supported features in GatewayClass Status\nGatewayClass status has a new field, supportedFeatures.\nThis addition allows implementations to declare the set of features they support. This provides a clear way for users and tools to understand the capabilities of a given GatewayClass.\nThis feature's name for conformance tests (and GatewayClass status reporting) is SupportedFeatures.\nImplementations must populate the supportedFeatures field in the .status of the GatewayClass before the GatewayClass\nis accepted, or in the same operation.\nHere’s an example of a supportedFeatures published under GatewayClass' .status:\napiVersion: gateway.networking.k8s.io/v1\nkind: GatewayClass\n...\nstatus:\n conditions:\n - lastTransitionTime: \"2022-11-16T10:33:06Z\"\n message: Handled by Foo controller\n observedGeneration: 1\n reason: Accepted\n status: \"True\"\n type: Accepted\n supportedFeatures:\n - HTTPRoute\n - HTTPRouteHostRewrite\n - HTTPRoutePortRedirect\n - HTTPRouteQueryParamMatching\n\n\nGraduation of SupportedFeatures to Standard, helped improve the conformance testing process for Gateway API.\nThe conformance test suite will now automatically run tests based on the features populated in the GatewayClass' status.\nThis creates a strong, verifiable link between an implementation's declared capabilities and the test results,\nmaking it easier for implementers to run the correct conformance tests and for users to trust the conformance reports.\nThis means when the SupportedFeatures field is populated in the GatewayClass status there will be no need for additional\nconformance tests flags like –suported-features, or –exempt or –all-features.\nIt's important to note that Mesh features are an exception to this and can be tested for conformance by using\nConformance Profiles, or by manually providing any combination of features related flags until the dedicated resource\ngraduates from the experimental channel.\nNamed rules for Routes\nGEP-995: Adding a new name field to all xRouteRule types (HTTPRouteRule, GRPCRouteRule, etc.)\nLeads: Guilherme Cassolato\nThis enhancement enables route rules to be explicitly identified and referenced across the Gateway API ecosystem.\nSome of the key use cases include:\nStatus: Allowing status conditions to reference specific rules directly by name.\nObservability: Making it easier to identify individual rules in logs, traces, and metrics.\nPolicies: Enabling policies (GEP-713) to target specific route rules via the sectionName field in their targetRef[s].\nTooling: Simplifying filtering and referencing of route rules in tools such as gwctl, kubectl, and general-purpose utilities like jq and yq.\nInternal configuration mapping: Facilitating the generation of internal configurations that reference route rules by name within gateway and mesh implementations.\nThis follows the same well-established pattern already adopted for Gateway listeners, Service ports, Pods (and containers),\nand many other Kubernetes resources.\nWhile the new name field is optional (so existing resources remain valid), its use is strongly encouraged.\nImplementations are not expected to assign a default value, but they may enforce constraints such as immutability.\nFinally, keep in mind that the name format is validated,\nand other fields (such as sectionName)\nmay impose additional, indirect constraints.\nExperimental channel changes\nEnabling external Auth for HTTPRoute\nGiving Gateway API the ability to enforce authentication and maybe authorization as well at the Gateway or HTTPRoute level has been a highly requested feature for a long time. (See the GEP-1494 issue for some background.)\nThis Gateway API release adds an Experimental filter in HTTPRoute that tells the Gateway API implementation to call out to an external service to authenticate (and, optionally, authorize) requests.\nThis filter is based on the Envoy ext_authz API, and allows talking to an Auth service that uses either gRPC or HTTP for its protocol.\nBoth methods allow the configuration of what headers to forward to the Auth service, with the HTTP protocol allowing some extra information like a prefix path.\nA HTTP example might look like this (noting that this example requires the Experimental channel to be installed and an implementation that supports External Auth to actually understand the config):\napiVersion: gateway.networking.k8s.io/v1\nkind: HTTPRoute\nmetadata:\n name: require-auth\n namespace: default\nspec:\n parentRefs:\n - name: your-gateway-here\n rules:\n - matches:\n - path:\n type: Prefix\n value: /admin\n filters:\n - type: ExternalAuth\n externalAuth:\n protocol: HTTP\n backendRef:\n name: auth-service\n http:\n # These headers are always sent for the HTTP protocol,\n # but are included here for illustrative purposes\n allowedHeaders:\n - Host\n - Method\n - Path\n - Content-Length\n - Authorization\n backendRefs:\n - name: admin-backend\n port: 8080\n\n\nThis allows the backend Auth service to use the supplied headers to make a determination about the authentication for the request.\nWhen a request is allowed, the external Auth service will respond with a 200 HTTP response code, and optionally extra headers to be included in the request that is forwarded to the backend. When the request is denied, the Auth service will respond with a 403 HTTP response.\nSince the Authorization header is used in many authentication methods, this method can be used to do Basic, Oauth, JWT, and other common authentication and authorization methods.\nMesh resource\nLead(s): Flynn\nGEP-3949: Mesh-wide configuration and supported features\nGateway API v1.4.0 introduces a new experimental Mesh resource, which provides a way to configure mesh-wide settings and discover the features supported by a given mesh implementation. This resource is analogous to the Gateway resource and will initially be mainly used for conformance testing, with plans to extend its use to off-cluster Gateways in the future.\nThe Mesh resource is cluster-scoped and, as an experimental feature, is named XMesh and resides in the gateway.networking.x-k8s.io API group. A key field is controllerName, which specifies the mesh implementation responsible for the resource. The resource's status stanza indicates whether the mesh implementation has accepted it and lists the features the mesh supports.\nOne of the goals of this GEP is to avoid making it more difficult for users to adopt a mesh. To simplify adoption, mesh implementations are expected to create a default Mesh resource upon startup if one with a matching controllerName doesn't already exist. This avoids the need for manual creation of the resource to begin using a mesh.\nThe new XMesh API kind, within the gateway.networking.x-k8s.io/v1alpha1 API group,\nprovides a central point for mesh configuration and feature discovery (source).\nA minimal XMesh object specifies the controllerName:\napiVersion: gateway.networking.x-k8s.io/v1alpha1\nkind: XMesh\nmetadata:\n name: one-mesh-to-mesh-them-all\nspec:\n controllerName: one-mesh.example.com/one-mesh\n\n\nThe mesh implementation populates the status field to confirm it has accepted the resource and to list its supported features ( source):\nstatus:\n conditions:\n - type: Accepted\n status: \"True\"\n reason: Accepted\n supportedFeatures:\n - name: MeshHTTPRoute\n - name: OffClusterGateway\n\n\nIntroducing default Gateways\nLead(s): Flynn\nGEP-3793: Allowing Gateways to program some routes by default.\nFor application developers, one common piece of feedback has been the need to explicitly name a parent Gateway for every single north-south Route. While this explicitness prevents ambiguity, it adds friction, especially for developers who just want to expose their application to the outside world without worrying about the underlying infrastructure's naming scheme. To address this, we have introduce the concept of Default Gateways.\nFor application developers: Just \"use the default\"\nAs an application developer, you often don't care about the specific Gateway your traffic flows through, you just want it to work. With this enhancement, you can now create a Route and simply ask it to use a default Gateway.\nThis is done by setting the new useDefaultGateways field in your Route's spec.\nHere’s a simple HTTPRoute that uses a default Gateway:\napiVersion: gateway.networking.k8s.io/v1\nkind: HTTPRoute\nmetadata:\n name: my-route\nspec:\n useDefaultGateways: All\n rules:\n - backendRefs:\n - name: my-service\n port: 80\n\n\nThat's it! No more need to hunt down the correct Gateway name for your environment. Your Route is now a \"defaulted Route.\"\nFor cluster operators: You're still in control\nThis feature doesn't take control away from cluster operators (\"Chihiro\").\nIn fact, they have explicit control over which Gateways can act as a default. A Gateway will only accept these defaulted Routes if it is configured to do so.\nYou can also use a ValidatingAdmissionPolicy to either require or even forbid for Routes to rely on a default Gateway.\nAs a cluster operator, you can designate a Gateway as a default\nby setting the (new) .spec.defaultScope field:\napiVersion: gateway.networking.k8s.io/v1\nkind: Gateway\nmetadata:\n name: my-default-gateway\n namespace: default\nspec:\n defaultScope: All\n # ... other gateway configuration\n\n\nOperators can choose to have no default Gateways, or even multiple.\nHow it works and key details\nTo maintain a clean, GitOps-friendly workflow, a default Gateway does not modify the spec.parentRefs of your Route. Instead, the binding is reflected in the Route's status field. You can always inspect the status.parents stanza of your Route to see exactly which Gateway or Gateways have accepted it. This preserves your original intent and avoids conflicts with CD tools.\nThe design explicitly supports having multiple Gateways designated as defaults within a cluster. When this happens, a defaulted Route will bind to all of them. This enables cluster operators to perform zero-downtime migrations and testing of new default Gateways.\nYou can create a single Route that handles both north-south traffic (traffic entering or leaving the cluster, via a default Gateway) and east-west/mesh traffic (traffic between services within the cluster), by explicitly referencing a Service in parentRefs.\nDefault Gateways represent a significant step forward in making the Gateway API simpler and more intuitive for everyday use cases, bridging the gap between the flexibility needed by operators and the simplicity desired by developers.\nConfiguring client certificate validation\nLead(s): Arko Dasgupta, Katarzyna Łach\nGEP-91: Address connection coalescing security issue\nThis release brings updates for configuring client certificate validation, addressing a critical security vulnerability related to connection reuse.\nHTTP connection coalescing is a web performance optimization that allows a client to reuse an existing TLS connection\nfor requests to different domains. While this reduces the overhead of establishing new connections, it introduces a security risk\nin the context of API gateways.\nThe ability to reuse a single TLS connection across multiple Listeners brings the need to introduce shared client certificate\nconfiguration in order to avoid unauthorized access.\nWhy SNI-based mTLS is not the answer\nOne might think that using Server Name Indication (SNI) to differentiate between Listeners would solve this problem.\nHowever, TLS SNI is not a reliable mechanism for enforcing security policies in a connection coalescing scenario.\nA client could use a single TLS connection for multiple peer connections, as long as they are all covered by the same certificate.\nThis means that a client could establish a connection by indicating one peer identity (using SNI), and then reuse that connection\nto access a different virtual host that is listening on the same IP address and port. That reuse, which is controlled by client side\nheuristics, could bypass mutual TLS policies that were specific to the second listener configuration.\nHere's an example to help explain it:\napiVersion: gateway.networking.k8s.io/v1\nkind: Gateway\nmetadata:\n name: wildcard-tls-gateway\nspec:\n gatewayClassName: example\n listeners:\n - name: foo-https\n protocol: HTTPS\n port: 443\n hostname: foo.example.com\n tls:\n certificateRefs:\n - group: \"\" # core API group\n kind: Secret\n name: foo-example-com-cert # SAN: foo.example.com\n - name: wildcard-https\n protocol: HTTPS\n port: 443\n hostname: \"*.example.com\"\n tls:\n certificateRefs:\n - group: \"\" # core API group\n kind: Secret\n name: wildcard-example-com-cert # SAN: *.example.com\n\n\nI have configured a Gateway with two listeners, both having overlapping hostnames.\nMy intention is for the foo-http listener to be accessible only by clients presenting the foo-example-com-cert certificate.\nIn contrast, the wildcard-https listener should allow access to a broader audience using any certificate valid for the *.example.com domain.\nConsider a scenario where a client initially connects to foo.example.com. The server requests and successfully validates the\nfoo-example-com-cert certificate, establishing the connection. Subsequently, the same client wishes to access other sites within this domain,\nsuch as bar.example.com, which is handled by the wildcard-https listener. Due to connection reuse,\nclients can access wildcard-https backends without an additional TLS handshake on the existing connection.\nThis process functions as expected.\nHowever, a critical security vulnerability arises when the order of access is reversed.\nIf a client first connects to bar.example.com and presents a valid bar.example.com certificate, the connection is successfully established.\nIf this client then attempts to access foo.example.com, the existing connection's client certificate will not be re-validated.\nThis allows the client to bypass the specific certificate requirement for the foo backend, leading to a serious security breach.\nThe solution: per-port TLS configuration\nThe updated Gateway API gains a tls field in the .spec of a Gateway, that allows you to define a default client certificate\nvalidation configuration for all Listeners, and then if needed override it on a per-port basis. This provides a flexible and\npowerful way to manage your TLS policies.\nHere’s a look at the updated API definitions (shown as Go source code):\n// GatewaySpec defines the desired state of Gateway.\ntype GatewaySpec struct {\n ...\n // GatewayTLSConfig specifies frontend tls configuration for gateway.\n TLS *GatewayTLSConfig `json:\"tls,omitempty\"`\n}\n\n// GatewayTLSConfig specifies frontend tls configuration for gateway.\ntype GatewayTLSConfig struct {\n // Default specifies the default client certificate validation configuration\n Default TLSConfig `json:\"default\"`\n\n // PerPort specifies tls configuration assigned per port.\n PerPort []TLSPortConfig `json:\"perPort,omitempty\"`\n}\n\n// TLSPortConfig describes a TLS configuration for a specific port.\ntype TLSPortConfig struct {\n // The Port indicates the Port Number to which the TLS configuration will be applied.\n Port PortNumber `json:\"port\"`\n\n // TLS store the configuration that will be applied to all Listeners handling\n // HTTPS traffic and matching given port.\n TLS TLSConfig `json:\"tls\"`\n}\n\n\nBreaking changes\nStandard GRPCRoute - .spec field required (technicality)\nThe promotion of GRPCRoute to Standard introduces a minor but technically breaking change regarding the presence of the top-level .spec field.\nAs part of achieving Standard status, the Gateway API has tightened the OpenAPI schema validation within the GRPCRoute\nCustomResourceDefinition (CRD)\nto explicitly ensure the spec field is required for all GRPCRoute resources.\nThis change enforces stricter conformance to Kubernetes object standards and enhances the resource's stability and predictability.\nWhile it is highly unlikely that users were attempting to define a GRPCRoute without any specification, any existing automation\nor manifests that might have relied on a relaxed interpretation allowing a completely absent spec field will now fail validation\nand must be updated to include the .spec field, even if empty.\nExperimental CORS support in HTTPRoute - breaking change for allowCredentials field\nThe Gateway API subproject has introduced a breaking change to the Experimental CORS support in HTTPRoute, concerning the allowCredentials field\nwithin the CORS policy.\nThis field's definition has been strictly aligned with the upstream CORS specification, which dictates that the corresponding\nAccess-Control-Allow-Credentials header must represent a Boolean value.\nPreviously, the implementation might have been overly permissive, potentially accepting non-standard or string representations such as\ntrue due to relaxed schema validation.\nUsers who were configuring CORS rules must now review their manifests and ensure the value for allowCredentials\nstrictly conforms to the new, more restrictive schema.\nAny existing HTTPRoute definitions that do not adhere to this stricter validation will now be rejected by the API server,\nrequiring a configuration update to maintain functionality.\nImproving the development and usage experience\nAs part of this release, we have improved some of the developer experience workflow:\nAdded Kube API Linter to the CI/CD pipelines, reducing the burden of API reviewers and also reducing the amount of common mistakes.\nImproving the execution time of CRD tests with the usage of envtest.\nAdditionally, as part of the effort to improve Gateway API usage experience, some efforts were made to remove some ambiguities and some old tech-debts from our documentation website:\nThe API reference is now explicit when a field is experimental.\nThe GEP (GatewayAPI Enhancement Proposal) navigation bar is automatically generated, reflecting the real status of the enhancements.\nTry it out\nUnlike other Kubernetes APIs, you don't need to upgrade to the latest version of\nKubernetes to get the latest version of Gateway API. As long as you're running\nKubernetes 1.26 or later, you'll be able to get up and running with this version\nof Gateway API.\nTo try out the API, follow the Getting Started Guide.\nAs of this writing, seven implementations are already conformant with Gateway API v1.4.0. In alphabetical order:\nAgent Gateway (with kgateway)\nAirlock Microgateway\nEnvoy Gateway\nGKE Gateway\nIstio\nkgateway\nTraefik Proxy\nGet involved\nWondering when a feature will be added? There are lots of opportunities to get\ninvolved and help define the future of Kubernetes routing APIs for both ingress\nand service mesh.\nCheck out the user guides to see what use-cases can be addressed.\nTry out one of the existing Gateway controllers.\nOr join us in the community\nand help us build the future of Gateway API together!\nThe maintainers would like to thank everyone who's contributed to Gateway\nAPI, whether in the form of commits to the repo, discussion, ideas, or general\nsupport. We could never have made this kind of progress without the support of\nthis dedicated and active community.\nRelated Kubernetes blog articles\nGateway API v1.3.0: Advancements in Request Mirroring, CORS, Gateway Merging, and Retry Budgets\n(June 2025)\nGateway API v1.2: WebSockets, Timeouts, Retries, and More\n(November 2024)\nGateway API v1.1: Service mesh, GRPCRoute, and a whole lot more\n(May 2024)\nNew Experimental Features in Gateway API v1.0\n(November 2023)\nGateway API v1.0: GA Release\n(October 2023)",
                    "newsPublishDate": "2025-11-06T17:00:00.000Z",
                    "newsLink": "https://kubernetes.io/blog/2025/11/06/gateway-api-v1-4/"
                },
                {
                    "newsTitle": "Secure Amazon Elastic VMware Service (Amazon EVS) with AWS Network Firewall",
                    "newsContentSnippet": "In this post, we demonstrate how to utilize AWS Network Firewall to secure an Amazon EVS environment, using a centralized inspection architecture across an EVS cluster, VPCs, on-premises data centers and the internet. We walk through the implementation steps to deploy this architecture using AWS Network Firewall and AWS Transit Gateway.",
                    "newsPublishDate": "2025-11-26T16:22:03.000Z",
                    "newsLink": "https://aws.amazon.com/blogs/architecture/secure-amazon-elastic-vmware-service-amazon-evs-with-aws-network-firewall/"
                },
                {
                    "newsTitle": "Building an AI gateway to Amazon Bedrock with Amazon API Gateway",
                    "newsContentSnippet": "In this post, we'll explore a reference architecture that helps enterprises govern their Amazon Bedrock implementations using Amazon API Gateway. This pattern enables key capabilities like authorization controls, usage quotas, and real-time response streaming. We'll examine the architecture, provide deployment steps, and discuss potential enhancements to help you implement AI governance at scale.",
                    "newsPublishDate": "2025-11-19T23:33:41.000Z",
                    "newsLink": "https://aws.amazon.com/blogs/architecture/building-an-ai-gateway-to-amazon-bedrock-with-amazon-api-gateway/"
                },
                {
                    "newsTitle": "Architecting for AI excellence: AWS launches three Well-Architected Lenses at re:Invent 2025",
                    "newsContentSnippet": "At re:Invent 2025, we introduce one new lens and two significant updates to the AWS Well-Architected Lenses specifically focused on AI workloads: the Responsible AI Lens, the Machine Learning (ML) Lens, and the Generative AI Lens. Together, these lenses provide comprehensive guidance for organizations at different stages of their AI journey, whether you're just starting to experiment with machine learning or already deploying complex AI applications at scale.",
                    "newsPublishDate": "2025-11-19T19:36:31.000Z",
                    "newsLink": "https://aws.amazon.com/blogs/architecture/architecting-for-ai-excellence-aws-launches-three-well-architected-lenses-at-reinvent-2025/"
                },
                {
                    "newsTitle": "A Tale Of Four Fuzzers",
                    "newsPublishDate": "2025-11-28T00:00:00.000Z",
                    "newsLink": "https://tigerbeetle.com/blog/2025-11-28-tale-of-four-fuzzers"
                },
                {
                    "newsTitle": "Mathematics of Consensus — Accidental Lecture",
                    "newsPublishDate": "2025-11-22T00:00:00.000Z",
                    "newsLink": "https://tigerbeetle.com/blog/2025-11-22-mathematics-of-consensus"
                },
                {
                    "newsTitle": "We stopped roadmap work for a week and fixed 189 bugs",
                    "newsContentSnippet": "Discussed on Hacker News, lobste.rs and r/programming\nIt’s Friday at 4pm. I’ve just closed my 12th bug of the week. My brain is completely fried. And I’m staring at the bug leaderboard, genuinely sad that Monday means going back to regular work. Which is weird because I love regular work. But fixit weeks have a special place in my heart.\nWhat’s a fixit, you ask?\nOnce a quarter or so, my org with ~45 software engineers stops all regular work for a week. That means no roadmap work, no design work, no meetings or standups.\nInstead, we fix the small things that have been annoying us and our users:\nan error message that’s been unclear for two years\na weird glitch when the user scrolls and zooms at the same time\na test which runs slower than it should, slowing down CI for everyone\nThe rules are simple: 1) no bug should take over 2 days and 2) all work should focus on either small end-user bugs/features or developer productivity.",
                    "newsPublishDate": "2025-11-22T18:20:00.000Z",
                    "newsLink": "https://lalitm.com/fixits-are-good-for-the-soul/"
                },
                {
                    "newsTitle": "TIL: Number in man page titles (e.g. sleep(3))",
                    "newsContentSnippet": "If you do Linux systems programming, you will have likely pored over man pages, either on the command line or, my personal preference, using the excellent man7.org or linux.die.net.\nI’ve always seen the numbers in sleep(3) and read(2) and idly wondered what they meant, but never actually bothered to look them up.\nThat is, until a review comment on a pull request:\n// Behaves like man 2 basename\nreviewer: nit: it’s not a syscall, so “man 2” is incorrect\nSo I looked it up. The answer was in the man(1) page (also accessible via the delightful man man command):\nThe table below shows the section numbers of the manual followed by the types of pages they contain.\n 1 Executable programs or shell commands\n2 System calls (functions provided by the kernel)\n3 Library calls (functions within program libraries)\n(... less common section numbers)\n\nSo my colleague was right and the code should have read // behaves like man 3 basename as basename(3) is a libc library call.",
                    "newsPublishDate": "2025-11-17T13:10:00.000Z",
                    "newsLink": "https://lalitm.com/til-number-in-man-page-titles-e-g-sleep-3/"
                },
                {
                    "newsTitle": "When Good Technical Writing Isn't Enough",
                    "newsContentSnippet": "Last week, I came across Don’t Build an Audience. It’s a fascinating post and has been occupying a lot of my “free thinking” time. I strongly suggest reading it as it’s well written and excellently argued.\nTo summarise what it tries to say:\nThe market for written content on the web (blog posts, articles etc) is “efficient”: in other words, great work will find its audience without you needing to build a “following” first.\n“Liquidity providers” (influencers, curators, algorithms) are incentivized to share good content because it benefits them. They maintain credibility and engagement by surfacing quality work. Specifically called out are Substack, Alexey Guzey and Tyler Cowen.\nYou can speed up “distribution” of what you write with minimal effort. Just 30 minutes to email a few key people and posts on the “right” platforms.\nTherefore, focus on creating excellent work rather than “building an audience”. If it’s truly good, the market will ensure it reaches “everyone who matters”.\nI’m a very strong believer in the core message of “make cool things rather than chase followers”. It’s something I’ve done throughout my life and I have zero interest in changing that going forward.\nBut I don’t agree with the argument that the market is efficient for all types of written content. I think the author is over-indexing on what they write about: topics accessible for a wide audience and do not require background knowledge (e.g. philosophical musings, economic theory, social dynamics).\nI write about technical topics. Sometimes this can be so deeply in the weeds that at most a few thousand people in the world would care about it. But it might totally change how these people work: it might teach about how to debug performance in their code, let them know about a new approach to analysing data or even inspires them build an entirely new program.",
                    "newsPublishDate": "2025-11-12T20:14:00.000Z",
                    "newsLink": "https://lalitm.com/on-why-i-write-this-blog/"
                },
                {
                    "newsTitle": "CAST(x AS STRING) casts to integer in SQLite",
                    "newsContentSnippet": "Discussed on lobste.rs.\nAs an “SQLite consultant” for my local area of Google, I often have people come to me having written SQL like:\nSELECT CAST(bar AS STRING) AS baz\nFROM foo\n\nand ask me “Why is baz always an integer?! Have I hit an SQLite bug?”.\nI have to again reach for my list of “odd quirks that SQLite has that people don’t know about”. Because this is not a bug, at least according to the SQLite manual.\nInstead, the correct way to write the above query is:\nSELECT CAST(bar AS TEXT) AS baz\nFROM foo\n\nThe reason for this? Quoting from “Determination of Column Affinity”\nFor tables not declared as STRICT, the affinity of a column is determined by the declared type of the column, according to the following rules in the order shown:\nIf the declared type contains the string “INT” then it is assigned INTEGER affinity.\nIf the declared type of the column contains any of the strings “CHAR”, “CLOB”, or “TEXT” then that column has TEXT affinity. Notice that the type VARCHAR contains the string “CHAR” and is thus assigned TEXT affinity.\nIf the declared type for a column contains the string “BLOB” or if no type is specified then the column has affinity BLOB.\nIf the declared type for a column contains any of the strings “REAL”, “FLOA”, or “DOUB” then the column has REAL affinity.\nOtherwise, the affinity is NUMERIC.\nSTRING does not match any of the numbered rules and so fallback to NUMERIC affinity which, in the general case, means integer.\nDue to SQLite’s staunch stance of being “backwards compatible” there’s very little chance of this paper-cut ever going away. But at least next time someone comes to me with this issue, I’ll be able to link to this post instead of writing the same thing for the nth time :)",
                    "newsPublishDate": "2025-11-03T13:15:00.000Z",
                    "newsLink": "https://lalitm.com/cast-x-as-string-casts-to-integer-in-sqlite/"
                },
                {
                    "newsTitle": "TIL: Diátaxis: Systematic technical documentation",
                    "newsContentSnippet": "A few weeks ago, I wrote about “The Documentation System” and how valuable I found it. As I dug deeper into researching how best to apply the principles outlined there, I came across Diátaxis. Written by the same author after they left Divio, Diátaxis is a distillation of all the principles with much more guidance in how to apply the framework (e.g. giving more examples), diving more into the philosophy and in general being a more comprehensive view into how to write great technical docs.\nI’m blown away by how well the framework (and Diátaxis makes clear it is a framework not a rigid set of rules) is explained. It’s patently obvious that the author really understands technical documentation and they truly have given a gift to the industry by writing it up.\nFinding Diátaxis has only made me more motivated to deeply absorb its principles and see how to best apply it to all technical documentation I refactor and/or write going forward.",
                    "newsPublishDate": "2025-11-02T23:44:00.000Z",
                    "newsLink": "https://lalitm.com/til-diataxis-systematic-technical-documentation/"
                }
            ]
        }
    }
]